--[[
	code generated using luamin.js, Herrtt#3868
--]]


_BAgdA0hhETDBvdl7, Protected_by_MoonSecV2, Discord = 'discord.gg/gQEH2uZxUk'


, nil, nil;
(function()
	_msec = (function(L_1_arg0, L_2_arg1, L_3_arg2)
		local L_4_ = L_2_arg1["ټټ؃سحڝ؃دحن"];
		local L_5_ = L_3_arg2[L_1_arg0[(1344 - 697)]][L_1_arg0["ڝسققآنڝؠؠضقك"]];
		local L_6_ = (130 - 126) / (396 / ((10829 / (169 - 120)) + -#'WHY DO PEOPLE EXIST MAN'))
		local L_7_ = (77 - ((-111 + 388) - 202)) - (138 / 138)
		local L_8_ = L_3_arg2[L_1_arg0[142]][L_1_arg0["ڪڝآ؃قدكقق"]];
		local L_9_ = (29 / (161 - (341 - 209))) + (111 - 109)
		local L_10_ = L_3_arg2[L_1_arg0[((-94 + 688) + -#[[Oh you you know lua? Name every metamethod]])]][L_1_arg0["ؠآدزڝدآسجكڪحضټكضئآز"]]
		local L_11_ = (125 + -123) - (((379 + -55) + -126) / 198)
		local L_12_ = ((((((1041 - (1245 - 682)) + -#"Stop it; get some help") - 268) + -#[[watching psu beat luraph]]) - 131) + -#"ThatExclamationMarkGuy was here")
		local L_13_ = (-#{
			(function()
				return ('lBoIAi'):find("\111")
			end)(),
			82;
			1;
			(function(L_55_arg0)
				return L_55_arg0
			end)()
		} + 5)
		local L_14_ = (((-#[[Watching Federal discontinue PSU cause of a insane man owning it]] + ((529 + (-17 - 49)) - 258)) - 90) + -#"Slowmode is enabled, but you are immune. Amazing!")
		local L_15_ = (5 + -#{
			1;
			1;
			6
		})
		local L_16_ = (-#{
			(function()
				return ('IoH1EC'):find("\72")
			end)();
			'}',
			'}',
			'nil'
		} + 6)
		local L_17_ = (113 - (((50292 / 22) / 9) - 143))
		local L_18_ = (((91 + (-#"FreE RoBuX!1: Just go to this non suspicious virus i mean legit link" + (((316 - 174) + -#'Hazed Is The Best!') - 82))) - 43) + -#"Hazed Is The Best!")
		local L_19_ = (-#'peptskull is hot' + ((((-31 + (-#[[Watching Doge Winning]] + (-11980 + -28))) / 201) + -#"amogus") + 86))
		local L_20_ = ((7828 / (130 + (-6723 / 249))) - 72)
		local L_21_ = (((9765 / ((266 - 191) + -#"You know math? sqrt(-2) * sqrt(-32) = ??")) - 175) - 100)
		local L_22_ = ((-#[[are you black ?]] + (173 + (10 + (-44 - 32)))) + -88)
		local L_23_ = (7 + -#{
			(function()
				return {
					','
				}
			end)();
			{};
			(function()
				return ('iRINOR'):find("\73")
			end)();
			(function()
				return ('lHEH1o'):find("\19")
			end)()
		})
		local L_24_ = (((-#{
			(function()
				return {
					','
				}
			end)(),
			(function()
				return {
					','
				}
			end)();
			63,
			(function()
				return ('OIRC0E'):find("\9")
			end)(),
			(function(L_56_arg0)
				return L_56_arg0
			end)(),
			(function()
				return ('OIRC0E'):find("\9")
			end)()
		} + 121) + -107) + -#"AMONG US")
		local L_25_ = (130 - (-#"WendyWasHere:)" + (-71 + (((48120 + -50) / 209) + -#[[Hazed Is The Best!]]))))
		local L_26_ = (33 + ((47 - (-#"FreE RoBuX!1: Just go to this non suspicious virus i mean legit link" + (-114 + (498 - 278)))) + -#'I have 0x in my nickname and I am cool.'))
		local L_27_ = (-#"Why are you looking here lol?" + (135 - (105 + -#{
			{};
			(function()
				return {
					','
				}
			end)(),
			kernel32dII;
			(function(L_57_arg0)
				return L_57_arg0
			end)();
			(function()
				return ('E1B0Ai'):find("\18")
			end)()
		})))
		local L_28_ = (-#'Haram channel' + ((-#'lets jump on the psu grave bois' + ((-#{
			(function()
				return ('8R1iI1'):find("\49")
			end)(),
			(function()
				return {
					','
				}
			end)(),
			(function()
				return ('8R1iI1'):find("\49")
			end)(),
			(function()
				return ('BBAEBi'):find("\15")
			end)()
		} + 595) / 4)) - 101))
		local L_29_ = (50 + ((-1965446 / ((556 - 336) + -#[[PSU left the chat]])) / 206))
		local L_30_ = L_1_arg0[(2796 - 1445)];
		local L_31_ = L_3_arg2[L_1_arg0[(392 - (252 + -#{
			21;
			'nil',
			(function()
				return ('ERBEiH'):find("\8")
			end)(),
			(function(L_58_arg0)
				return L_58_arg0
			end)(),
			kernel32dII,
			kernel32dII;
			(function()
				return ('ERBEiH'):find("\8")
			end)()
		}))]][L_1_arg0["جكضكجئڝسڝ"]];
		local L_32_ = L_3_arg2[(function(L_59_arg0)
			return type(L_59_arg0):sub(1, 1) .. '\101\116'
		end)('ټنحضآڝؠح') .. '\109\101' .. ('\116\97' or 'ئټئنضټقك') .. L_1_arg0[(592 + -40)]];
		local L_33_ = L_3_arg2[L_1_arg0[(555 + -#{
			(function()
				return ('0E88li'):find("\56")
			end)();
			(function()
				return {
					','
				}
			end)();
			",",
			(function(L_60_arg0)
				return L_60_arg0
			end)(),
			(function()
				return ('i8OBiE'):find("\16")
			end)()
		})]][L_1_arg0["؃ددكدڝسسضز؃حڪئ"]];
		local L_34_ = L_3_arg2[type("\199\15\105\100")]["\102\105" .. (function()
			return ____ and "\93\102" or "\110"
		end)() .. "\100"](L_3_arg2[type('\199\15\105\100')]['\100\117' .. (function()
			return #{
				_return
			} and '\180\100\158' == "\18\100\158" or ('\109')
		end)() .. "\112"](L_3_arg2["_" .. "\109\115\101\99"]), '\112\114' .. (function()
			return _F or '\105\110' or '\199\109'
		end)() .. '\116') and (-#'table.concat = nil' + (137 + -85)) or (-50 + 52) - (((888 + (-#"Slowmode is enabled, but you are immune. Amazing!" + (-75 + 94))) / 78) + -#".prune 15")
		local L_35_ = (-#"imagine sending a crash video without any warning and thinking its funny" + (((-108 + 10) + 14084) / 189)) - ((-78 + 130) + -#"Oh you know how to breathe? Inhale and dont exhale")
		local L_36_ = L_3_arg2[L_1_arg0[(236 + -94)]][L_1_arg0["ڝح؃سآټجټؠ"]];
		local L_37_ = function(L_61_arg0, L_62_arg1)
			return L_61_arg0 .. L_62_arg1
		end
		local L_38_ = (62 - 58) * (((570768 / 47) / 184) - 62)
		local L_39_ = L_3_arg2[L_1_arg0["ڪټززكحڝزقؠسڝحزڝټحضؠ"]];
		local L_40_ = ((222 - 172) + -#[[This script is sponsored by raid: shadow legends]]) * ((1766912 / (16240 / 140)) / 119)
		local L_41_ = (1118 + -94) * ((107 + (-92 + -33)) + 20)
		local L_42_ = (138 - (-#"This script is sponsored by raid: shadow legends" + ((5623712 / 244) / 172)))
		local L_43_ = ((135 + (-20355 / (460 - 283))) + -#[[Hazed Is The Best!]]) * (123 - 121)
		local L_44_ = L_3_arg2[L_1_arg0["حقټجحججج؃آسزسجڝدنز"]] or L_3_arg2[L_1_arg0[(1139 - 587)]][L_1_arg0["حقټجحججج؃آسزسجڝدنز"]];
		local L_45_ = (-18 + ((4560456 / 76) / 219))
		local L_46_ = L_3_arg2[L_1_arg0["دحقجټدضجككجسئآكج؃آؠ"]];
		local L_47_ = (function(L_63_arg0)
			local L_64_, L_65_ = 2, 16
			local L_66_ = {
				j = {},
				v = {}
			}
			local L_67_ = -L_11_
			local L_68_ = L_65_ + L_7_
			while true do
				L_66_[L_63_arg0:sub(L_68_, (function()
					L_68_ = L_64_ + L_68_
					return L_68_ - L_7_
				end)())] = (function()
					L_67_ = L_67_ + L_11_
					return L_67_
				end)()
				if L_67_ == (L_38_ - L_11_) then
					L_67_ = ""
					L_65_ = L_34_
					break
				end
			end
			local L_69_ = #L_63_arg0
			while L_68_ < L_69_ + L_7_ do
				L_66_.v[L_65_] = L_63_arg0:sub(L_68_, (function()
					L_68_ = L_64_ + L_68_
					return L_68_ - L_7_
				end)())
				L_65_ = L_65_ + L_11_
				if L_65_ % L_6_ == L_34_ then
					L_65_ = L_35_
					L_33_(L_66_.j, (L_36_((L_66_[L_66_.v[L_35_]] * L_38_) + L_66_[L_66_.v[L_11_]])))
				end
			end
			return L_10_(L_66_.j)
		end)("..:::MoonSec::..؃دحجئضسزقكنؠآټڪڝحڝؠضؠحنڝحقنڝنسنجن؃ټڪ؃ز؃س؃كڝڝ؃حټزك؃قضقحزڝآڝټآڪقټقټڪؠئټڝټ؃قسسضضڪضؠضقنضؠجآدآ؃ڪڝئڝئجئ؃جټكټكڝكضنجقڝقڪكآقنكئكؠدټدكدسدجزدڝضدح؃ز؃ئ؃دئسسڝسآسضئحضڪضڝضټڝسڪزڪ؃ټټټنئزجضئجئحئټټ؃آضآحؠڝ؃ڝدڪحن؃سدجدآدآ؃آدننككڪكؠكقټټ؃زڝآڪټڝزڝضڪآڪئ؃ضقئزززئزدآدڪ؃ټنآؠآجآحآدن؃آؠؠآ؃قسضئنئزئئؠدكڝنڪنآكنكئكقكنضزقككحقټئآقآزققؠئ؃قجضسجؠجآئقسكئدسټڝؠڝجڝ؃ڪټدڝآؠقؠضئ؃آآجڪ؃ټضټحآڝ؃ڪجقحنجآ؃زجسحآحسجئؠزنڪنؠنققئټجضڪجؠنآؠ؃جكن؃قټقنقزآآڝسڪؠټآڪسڪئټؠټجؠڪټقټضټزؠ؃ؠڪآآآؠؠحضكئڪئؠئقنزنؠؠجسنكؠنڪنحنححدحڝحزحئحدسؠقنقسزنقؠدڝدز؃ك؃س؃جئآسحضؠضؠضكسجض؃ضنئكضزئسنڝڪزټكټسټجدآجآحټحقج؃ددحندآجددنحئټټؠحنكنسنجدج؃ضڝؠڝؠ؃ج؃قدآكسقققضقحڪسؠ؃قئضدحدكڝآجققضقدڝڪئڝحضڝضقضضضحآجؠضؠسنؠضڝئججټجنجزق؃كسكضدڝجسحضححدڝقجزنقجزققجزحزقزنسكج؃سسسڝسآسضض؃ڝقڪآڪكڪسج؃ئدئئئقئ؃ئقئسجحج؃زقآؠآحؠڝؠآڪټنټسنح؃ڪئكآحڝنزندكڪكؠټټڪقڪحجضكدقكقسقجټضآدڪجڪئنسكجزسسؠسقسضنئآڪآ؃ټحكټآآآحؠآڪحئنئئئدجڪس؃ج؃ڪزټقجقحآحكحسكنقڝقڝقضقنقئزحزدز؃جآدح؃حڝڝڝآضنسسضآدڝسئئڝئكئآض؃ئټئسئؠ؃ئححټضآآآكآسڪنڪټڝدئټڪسآؠجڝؠزنؠنقنضڪئ؃ڪ؃؃دحټآ؃ح؃حڝ؃ڪڝڪڝقنقدزڪزؠ؃آدحآكآحآنحؠكئسڝس؃ضټضننؠآسؠنؠضؠحنټؠزقزؠضندنزنندؠجزحټحنحزقققنكدزڪقزقززسڪق؃آ؃ك؃س؃ج؃؃ڝټجججزڝقڝنڪڪڪؠڪقضآئجئؠئزئآئسجقجضجدضحټدآئآدؠڪ؃سحددقدټڝڝدق؃ندڝ؃قدحزككڪكزكئكدڝضڪآڝضڪنڝحقئزآزكزسؠؠټڝټؠآڝڪ؃ټنز؃ضڪضؠضقؠكآضؠضسآؠحؠكسجنقكڪنآنئن؃كسندكڪجححنححدڝدآضآزڪزققجقدكقدد؃ئ؃دڝڪئدسدسزضزئحضدضؠضآئقضحسؠټڝټزټئټددئجنجنحقحزڪدآدؠكؠسؠج؃حدسدد؃ڝدقنضنضكؠكقكضټضڝڪڝڪڪڪآټڝقڪكزدزڪزززئزدؠسټ؃آكآكڪدضڝضآضكضسضجك؃كټقنآجئؠئدجڪجؠكڪنزندكآزڪز؃سققدحكدټدندزسؠزحزنزسزؠزضسزسئس؃؃ڝڝنڝجڝ؃ڪټجحئآئضئضكسڪضټقټضټحدكجڝجقجئ؃زحضح؃حكدؠدكحؠؠئنؠنقنضضكټحكڪآؠنؠؠټزقك؃قنقزقئآقڪجڪڝنسزؠزحسڝسآآؠقدحنآكزدحڪقدكنضټئڪئؠئققسنسنجقدؠدنننضكدز؃قؠكنقآڪؠحسدؠدقدضضؠزټزڝزټسززدسجسحضس؃دڝئڝدڪڪ؃ؠآنكټئڪ؃ؠټآكقئن؃كټئجدآؠآزآئآدحڪدڝآجؠضؠحنڝڪڝدحدن؃آدن؃ح؃ق؃نڝآڝنڝڪضڪقققضقحزڝزآجكآنؠجئآزسسنسزسئآقؠڝآقؠټآقؠزؠټؠڝنڪآقئسئ؃جټجننضككنقضجحؠحقحضححدڝدآسزضسزددآ؃ټ؃ن؃زئټسڝزئسنسجضنئضضئضڪضڝئؠضضڝآڪحټنټزټئدئجنجنجڝجججڪآقؠآؠكؠسڝضدڝددحجڪټدجدج؃د؃؃؃قكؠكحقڝقآټكڝحڪئڝكڪحڪآكجقجزدسڪسؠنكآكآسنئټحؠڪآئآزكقنڪؠقنؠؠ؃نسؠ؃ئحجقجضجححڝحآحكسڪسجسآحؠدندزدئضڝزجقحزآزئز؃زحسؠضڝسنجټئججآجقجزڪنڪدټڪټؠجآضڪزټضدڝآټئڪ؃ټقآ؃ؠټؠنټآن؃سكدقڪجنضضسټڝټزكسدټدئؠټز؃جحټؠټټقدضڪڝنآڝكنزؠزحسڝسآؠؠآؠټ؃آڝټدؠڝسضضؠضدئڪئؠز؃حټڝؠنآسنجحڝككؠجضحټحنحزضضدسآآك؃ضضڪضدك؃ڝ؃آ؃كضآسقسجزدسكسكحززڝڝزڪؠڪقڪضحضئزجټئؠجزجسئئجحجآئټټضآدؠڪؠؠټقزنجقدټټكزضحجدنټكزضئجڝحنڝنحئڝدسن؃جدقززڝزآزكآكټسټڝټڝآڝ؃زسڪسدضڪضؠكڝؠنآسنحؠدؠؠؠآنآنجنحضآجڪجئجدحڪكجكآكككحضكئؠئقضآدضد؃؃ټ؃نزسززح؃ڝڪڝؠڝقڝضڝحسڝج؃حكزڪڝكڪ؃ټټټنڪقآكقضئكڝكؠسقسجسڝئسڝقضجس؃؃ؠجحندسڝزؠسزئدقڪكنسنؠكؠقڝقآقكټټڝحڝحڪقڪټڪزټضټئټجڪزسآسضسحضڝنقؠڪؠآآزضئض؃ئنئزئئقحقڪقئڝسجؠجححڝحآزسكضكدقؠقحكجنؠدآدد؃ڪ؃ؠئؠسسسڪسؠضڪضنضكضڪحنڝدڪنڪزڪئئحجټدآڝدڝټټټآڝآآآك؃زحزحټحسحق؃كدكدڪدټدڝ؃ټدؠنقكڝكآككڝڪؠڝق؃حڪڝزؠضكئقضزڪزؠزقټزؠ؃زټسح؃جز؃سجس؃ضټآجآنآ؃ؠئؠنؠنؠؠؠنؠئنئسحئدجسججج؃جنحضؠضنجضقڝسټززددڝدټ؃ڝ؃آ؃كسكسؠسضس؃سضضنضضضټضنض؃ضنئڝڪؠټڝټآټكحسجڝجدئسحڝجك؃ؠجسحزززؠټؠضؠحنڝټټقڝئآدسټضقضكڪكزكئكدټسڝ؃ڪكڪكڝڪقجزآزكزسټئكئسزحقززسزسدضڪضؠؠكآضؠؠؠجض؃ئكئسئجنزكڪنزكآقسجقحڪحؠحقسټكسكجقآس؃زؠقزټندد؃ن؃ز؃ئئئضڝسڪس؃ضټڝآڪڝڪآڪكدجټضقسئقدسټسكجئك؃ټآضحسآكآحؠڝؠآ؃جحكححدڪززؠؠنزنئندڝ؃؃؃؃ق؃دڝؠڝحڪټڝټڪؠڪزټجڝدڪكڪكټضټقټجقؠزئسضسحضڝسقدڪ؃حنضسحئقد؃آقزآجڪ؃ؠنحڝآئكجححڝحآزآقؠكزز؃قڝقجقئزضقجقزضؠسكزززسئحئحسؠضزس؃ضضس؃ڪنڪزڪئڪدټڪټؠڪ؃دض؃نټضآآآكآسققضڝجئڪآڝټد؃قزؠئنؠنقنضدن؃ڝڝڝڝن؃حڝڝئقكققنقزقئڪټڪجټآټآټنڪئڪحڪ؃آنټنټسحئسسضنضزضئآقؠجنټؠ؃ؠئؠدننقضزټڪقجنج؃حټحنسنقټكضقزكضزټقجق؃؃ڝ؃آ؃ك؃قئئ؃؃ڝټڝنڝكڝئڝدڪڪڝټجټڪضڪحټڝدكټكټسټجټ؃آټآنآزآئآدؠڪؠؠؠقؠضؠحنڝنټنكنسنجن؃كټنآكزكئكحقڪڝؠقققضقحكدزآزكزززجآحسټسنسزقنسدضڪضآضقضڪضحض؃ئآكضئسئزضئجټجنجزجټجدحڝحؠحآجكححدڝدآحجدسدئد؃؃ټئج؃ز؃ئ؃دڝڝڝؠڝقڝضڝئج؃ڪآڪنڪسڪجڪ؃ټټټنڪكدنټدآڝآؠحؠآضآحؠڝؠآ؃؃ؠسؠئؠ؃نټنننزنئؠجؠټكؠكنكضڪنقڝقآقكققآئق؃ق؃زنزنزئزدسڪسؠكؠسضسسضڝضټضكضسضجض؃ئټئنئآئئئئجڪجؠجقئزجححڝجححككجحجح؃دټدندزدئدس؃ڪ؃ټ؃ق؃ز؃ح؃ضڝآڝكڝنڝجئؠڪټڪؠڪزڪكڪدڪحڪڝټقټضټححنآآآنآسآجڝنؠټؠڝؠزؠزؠدنڪنؠؠنآحنحنضكآنضكسكجك؃كڝقنقزقؠقدڪدزؠزقزضقئسڝسآزدسسكآس؃ضټضنسكضئضدضزئؠسؠئضئحجڝئڪجكجسجټج؃سټحنحزحئحددڪدؠدڝدضدآ؃ڝ؃ڪ؃ك؃س؃ج؃؃؃جڝنڝټڝئڝقڪڪڪؠڪقڪضڪزټڝټڪټكټقټجټسآټآنآؠآئدآؠڪؠآؠقؠنؠحؠجآ؃نكنسنجڝؠكټكؠكزكئآؠقڪك؃قققققحزڝزآقؠكجزجزسسټزسسزسئسدز؃ضؠضقضآضحؠحئآئكئسضضئ؃جټئحجزكئجدحڪحؠجنحضحححقدآسئدسدجد؃دڝ؃ن؃ز؃ڪ؃دج؃ڝؠڝقڝضڝحڪڝڪآڝ؃ڪسڪټڪ؃ټڝټنټزټئټدټئآؠآڪآضآكؠڝؠآؠكؠسؠقؠ؃نڝنننكنئنزكڪكؠكآكضڪټقڝقټقكقؠقجقئكدزنزززئآآسڪسآسقسضكآضڝسدضكضكضجض؃ئټئآققئئئزجڪجآجقجضجححڝسححكحؠحجححدټدآدزدنجئ؃ڪد؃؃قضڝ؃ح؃؃ڝآڝكڝسڝز؃ئڪټڪنڪزجڪڪدټڝټؠټق؃ڝټحټئآآآآآسآجآ؃آڝڪنؠزؠنؠدآقنؠنقنضؠئكڝكآن؃كسؠدك؃قټقنككقئقدقسزؠؠسزضزحسڝسآسكسسسنس؃سئضنضڝضئضزئڪئؠئڝئضزڪجڝجټجكجزجججئئدحنحزحئضټدڪدآدقحزسض؃ڝدج؃كسك؃ج؃؃ڝټ؃آدسڝئڝكڪڪضجڪقڪضڪحڝدڝؠټكټڝټج؃زآټآنآزټسڪ؃ؠڪآضؠقڝقؠحنڝنآنكنڝنجنزكټنئكزكسكدقڪټئقققؠقحقضزآق؃زسزكنئسټز؃سزنئسدضڝضؠضكضضضسسجئآئكئسقجئ؃جڪجنئكقزجدجئحؠزسحضححدڝدآئڝدسدقد؃؃ڝ؃ن؃ك؃ئ؃ز؃ڪڝؠڝآڝضئټڪڝڪټڪكڪؠڪجڪئڝدټنټزټئحآآڪآآآقآضڝآؠڝآدؠكؠكؠجؠ؃نټؠآآئنئنزكڪؠضكقكضكحندقآقكقټقجڪجزټزنززقسزدسڪزجسقآسسحضڝضآسؠضسضجضكئټضقئزئئئدض؃جؠجقجڝجحقسحآحكحسحجح؃دټحددزدڪددد؃؃ؠ؃ق؃ض؃ح؃ضڝآڝڝڝسڝنڝ؃ڪټڪنڪزڪكڪدڪ؃ټؠټنټضټقآڝآآآټآسدڪآ؃ؠڪؠنؠآؠئؠضآحنؠنقنضڝټكڝكټكككسآټك؃كحقنقنقئقدزڪقټؠنزضزقسڝقسسكسسسجزحضټضنضڪضئؠئئڪئؠئقضزئحجڝئئجككئججج؃حټجآحزحئحندڪجآدقدضدححد؃آ؃كد؃؃جحسڝټڝنڝزڝئڝدڪڪڝحڪقڪڝڪحڪدټآټكټسټجټسآټټ؃آزآؠآدؠڪؠؠؠقؠنؠحؠدنآنؠنسنجن؃كټكڪكزكككدقڪقؠقآقضقحزڝزآټئزسزئز؃سټك؃سزسقسدضڪضؠضقضضضحكسئآئټئسئئئ؃جټجنجټسقجدجححؠقسحضحجدڝدټدكدنحزد؃؃ټ؃نسض؃ئ؃حڝڪڝڝ؃آڝضڝحڪڝضحڪكڪزڪجد؃ڪ؃ټنټآټئئجآڪ؃ضآقټز؃قؠڝآدؠكؠؠؠجؠ؃نټننڪ؃نئندكڪكآكقكضكحندټڝقكقؠقجڪسزټزنزززنقسسڪزدسقسكسحس؃ضآضنضسضجضنئټئنئزئسئدجڪجؠجقجؠجحجئحآحؠحسحئح؃حدحڪدزدئددسڝ؃ؠ؃ك؃ضدئضحڝآڝڪڝسئحڝ؃ڪټڪنڝكدسڪدڪئټؠجؠټضټحآڝټڪآكآسآنآ؃ټحؠنؠزؠئآجنڪنؠؠ؃نضدضكڝكآككنقكجك؃كسقنټ؃قئقدزڪزؠزقزضزقسڝزضسكسسسجس؃ضټضنضآضئضدئڪئآئقئضئحجڝجآجكجزججج؃حټحڝحزحئحدحسدؠدقدضنئدج؃آ؃ك؃سحسڝآؠسسسضكڝزڝدڪڪڪؠدآټټقكسؠڪ؃ټكټسټجڝئؠقز؃ئ؃؃ڪآزؠڪؠؠؠقڪكنكسسدآڪ؃كقجؠنآكټكنكزن؃ضسجنټټكنق؃ئق؃؃ؠئزسئجټنڪجسټسنسزسئسدضڪئؠكز؃ئضحئڝئآئكئسئجؠ؃زټؠآجزجئجدحڪئآحقحضححجدسڝدكدكدجدض؃ټ؃ن؃ز؃ئئنڝڪڝڪڝقڝقڝحڝ؃ڪآڪڝ؃كڪجڪجټټڪدټزټضټدآڪآؠآآټكآحؠڝؠآآ؃ؠسؠئؠ؃ؠڝڝټنزنزندنجكؠكقكضكحټققآقآقسقسق؃زڪزنززؠآزدزدسؠسنسضسحضڝسڪزقضسضسض؃ضجئنئزئئضجزؠجؠجآجضجنحڝحآحكجقحجح؃ححدندټدئدد؃ڪ؃ؠ؃ق؃ض؃قڝڝڝآڝكڝسڝج؃حڪټڪنڪڪڪئڪزټڪټؠټقټكټحآڝټدآكڪجآجآدؠټؠنڝدؠئؠننڪنڝنقنضنحؠدكآككن؃كجكئقټقنقزنئقدزڪقضزقزڝزحزحسآقكسسسجسؠضټضنضزضسضدئڪئؠئقضحئحئزجآجكجسججج؃حټجقحزحآحددڪدؠدقدضدحدن؃آدز؃س؃ض؃؃دټڝنڝزڝڝڝدڝكڪؠڪكڪضڪحټڝټآڪئټسټضټ؃آڝآنآزآئآدآكؠؠآجؠضؠضنڝآآنكنسنڪن؃نقكنكڪكئكدقڪقؠكحقضقئزڝزڪزكزسزجز؃زدسنز؃سئسؠضڪضؠضقضضضؠئڝئڝئكئقئجس؃جټجنجنجئجنحڪجححقحكحڪدڝحددكحجدجدد؃ټدآضن؃ئ؃سڝڪ؃؃ڝقڝضڝحڪڝڝزڪكڪؠڪجڪدټټټڪټزټئدكآڪآڝآقآزآحؠڝؠآؠكڪڝؠجؠ؃نټنؠنزنئندكڪكؠكقكضكضقڝقآقكقسقئق؃زټزنززنټزدسڪسؠسكسضسحضڝضآضكضسضجض؃ئڝئنئزئئ؃ڝئججؠجقجضسجدضټحكآضؠئقح؃دټدندزدئدد؃ڪ؃ؠحض؃ض؃حڝڝ؃ڪدقڝسڝضڝ؃ڪڝڪنڪزڪئڝجڝټټؠټؠټضټئآڝآآآكټقدسآ؃آدؠنؠقؠئؠدنڪؠدؠټنضنزكڝكآكككزكجكئقټقنكدقئقدزڪزټزقزضزحسڝزسسكسسسجس؃ضټضنضزضئضؠئڪئؠئقئقئحجڝجآجكئ؃ججج؃حټحؠحزحئحددڪحددقدكدحدد؃آ؃ن؃س؃كجآڝټڝنڝز؃؃ڝدڪڝڪؠڪكڪضڪسڝجټآټكټسټڝټ؃آڪآنآؠټقآدؠڪؠؠټدؠضؠجنڝؠحنټنسنجن؃ؠسكنكقكئكحقڪقڝكآقضقحزڝكضزكزززجزسزدسنسقسئزنضڪضآضقضضضحضجس؃ئكئسئجضكجټجؠجزجئزټحڪحڝحقحزححححدآدكسحدجدض؃ټ؃ټ؃ز؃س؃د؃ئڝڝڝقڝكڝح؃قڪآڪنڪسڪقڪ؃ڪدڪڪټزټئټدڪزآؠآكآضآح؃ؠؠآؠټؠسؠضؠ؃ؠ؃نننزڝ؃ندنجكؠكؠكضكئقڝكحقټقسقزق؃كسزنزقزئزسسڪسڝزآسضسحضڝزضضكضزضجضئسدئنئزئئضؠجڪجآجقجضضقحڝج؃حكحسحجح؃دټدنضڪدئدض؃ڪ؃آ؃ق؃ض؃حڝڝئئڝكڝنڝجڝحڪټڪنڪزڪئدنټڪټؠټقټسټحآڝآآآنآسآجآ؃ؠټؠنؠزؠئؠقنڪنؠنقنضټټكڝكآكككزكجك؃قټقنقزقئقدزڪزؠزقزضزحسڝسآسكسسسجس؃ضټضنضزضئضدئڪئؠئقئقئحجڝجآجكجسججج؃حټحنحزحئحددڪدؠدقدضدحدد؃آ؃ك؃س؃ج؃؃ڝټڝنڝزڝضڝدڪڪڪؠڪقڪضڪحټڝټآټؠټزټجټ؃آټكڪآآآئآدؠڪڪآكڪضؠحضڪئؠئنكنسنجن؃ڪئكنكقكئكدقڪقؠققكزټضزڝزڪزكزززجز؃سټز؃زآسئسئضڪضؠضقضسضحضدئآئكض؃ئجئ؃جټجؠجزجئجدحڪجضحقحضححدڝدآدكدسدجدس؃ټ؃آ؃ز؃س؃دڝڝڝؠڝقجټڝحڝ؃ڪآڪؠڪسڪجڪ؃ټټدجټزټئټدآڝآؠآقآضآجؠڝؠآؠكؠؠؠجؠ؃نټؠحنڝنئندكڪنقكجحجددآسسئئضټڝ؃جقسزټزنززنسدضحكحڪزدټسئدضڝضآضكضسضجض؃زڝقننضئقئدجڪجؠكؠكززنسققڪحڝحسحجح؃ضدددآڪقئئق؃؃دس؃ق؃ض؃حددحضڝكڝسڝجڝضڪټڪنڪزڝسڪدټڪټآټقټسټحآڝآآټؠآسآجآحؠټؠڪؠزؠئؠدآ؃نؠنقنقنحندكآكككسنضك؃قټقڪقزقزقدزڪزؠزقزضزحز؃سآسټسسسضس؃ضټضنضزضئضدئڪئؠئكئضئحجڝجآجنجسجئج؃حټحنحزحئحددڪدؠدندضدئ؃ڝ؃آ؃ك؃س؃ج؃؃ڝټڝنڝزڝئڝدڪڪڪؠڪقڪضڪجټڝټآټكټسټجټ؃آټآنآقآضآدؠڪؠؠق؃ؠنؠحنڝنآټنكؠضددضټنكڪكزكئكدن؃ټڪقققضقحق؃زآزكزسزجزڪسټسؠسزسئسدضڪضؠضقضؠضحئڝئآئؠئسئئئ؃جټزججزجئجدحڝحؠحقحضححدڝدآدكدسدج");
		local L_48_ = (88 - 85)
		local L_49_ = 72
		local L_50_ = L_11_;
		local L_51_ = {}
		L_51_ = {
			[(182 / 182)] = function()
				local L_70_, L_71_, L_72_, L_73_ = L_8_(L_47_, L_50_, L_50_ + L_9_);
				L_50_ = L_50_ + L_43_;
				L_49_ = (L_49_ + (L_48_ * L_43_)) % L_45_;
				return (((L_73_ + L_49_ - (L_48_) + L_40_ * (L_43_ * L_6_)) % L_40_) * ((L_6_ * L_41_) ^ L_6_)) + (((L_72_ + L_49_ - (L_48_ * L_6_) + L_40_ * (L_6_ ^ L_9_)) % L_45_) * (L_40_ * L_45_)) + (((L_71_ + L_49_ - (L_48_ * L_9_) + L_41_) % L_45_) * L_40_) + ((L_70_ + L_49_ - (L_48_ * L_43_) + L_41_) % L_45_);
			end,
			[((11200 / 224) + -#'Fun and games until a = (function() a() end) a()')] = function(L_74_arg0, L_75_arg1, L_76_arg2)
				local L_77_ = L_8_(L_47_, L_50_, L_50_);
				L_50_ = L_50_ + L_7_;
				L_49_ = (L_49_ + (L_48_)) % L_45_;
				return ((L_77_ + L_49_ - (L_48_) + L_41_) % L_40_);
			end,
			[(-#'brueh' + ((-#'stellar was here?!?!?!' + (-19 + 92)) - 43))] = function()
				local L_78_, L_79_ = L_8_(L_47_, L_50_, L_50_ + L_6_);
				L_49_ = (L_49_ + (L_48_ * L_6_)) % L_45_;
				L_50_ = L_50_ + L_6_;
				return (((L_79_ + L_49_ - (L_48_) + L_40_ * (L_6_ * L_43_)) % L_40_) * L_45_) + ((L_78_ + L_49_ - (L_48_ * L_6_) + L_45_ * (L_6_ ^ L_9_)) % L_40_);
			end,
			[(67 - 63)] = function(L_80_arg0, L_81_arg1, L_82_arg2)
				if L_82_arg2 then
					local L_83_ = (L_80_arg0 / L_6_ ^ (L_81_arg1 - L_11_)) % L_6_ ^ ((L_82_arg2 - L_7_) - (L_81_arg1 - L_11_) + L_7_);
					return L_83_ - L_83_ % L_11_;
				else
					local L_84_ = L_6_ ^ (L_81_arg1 - L_7_);
					return (L_80_arg0 % (L_84_ + L_84_) >= L_84_) and L_11_ or L_35_;
				end;
			end,
			[(100 / 20)] = function()
				local L_85_ = L_51_[(-53 + 54)]();
				local L_86_ = L_51_[(188 / 188)]();
				local L_87_ = L_11_;
				local L_88_ = (L_51_[(-#'Skids when they learn variables: Oh you know lua? Name every variable' + (260 - 187))](L_86_, L_7_, L_38_ + L_43_) * (L_6_ ^ (L_38_ * L_6_))) + L_85_;
				local L_89_ = L_51_[(-#'above is lie 0.o' + (((31372 / 44) + -#"constant dumB") / 35))](L_86_, 21, 31);
				local L_90_ = ((-L_11_) ^ L_51_[(125 + -121)](L_86_, 32));
				if (L_89_ == L_35_) then
					if (L_88_ == L_34_) then
						return L_90_ * L_35_;
					else
						L_89_ = L_7_;
						L_87_ = L_34_;
					end;
				elseif (L_89_ == (L_40_ * (L_6_ ^ L_9_)) - L_7_) then
					return (L_88_ == L_35_) and (L_90_ * (L_7_ / L_34_)) or (L_90_ * (L_35_ / L_34_));
				end;
				return L_5_(L_90_, L_89_ - ((L_45_ * (L_43_)) - L_11_)) * (L_87_ + (L_88_ / (L_6_ ^ L_42_)));
			end,
			[((147 - 104) + -#"Discord Dot Gee Gee Slash Pee Ess You")] = function(L_91_arg0, L_92_arg1, L_93_arg2)
				local L_94_;
				if (not L_91_arg0) then
					L_91_arg0 = L_51_[((-110 + 167) / 57)]();
					if (L_91_arg0 == L_35_) then
						return '';
					end;
				end;
				L_94_ = L_31_(L_47_, L_50_, L_50_ + L_91_arg0 - L_11_);
				L_50_ = L_50_ + L_91_arg0;
				local L_95_ = ''
				for L_96_forvar0 = L_7_, #L_94_ do
					L_95_ = L_30_(L_95_, L_36_((L_8_(L_31_(L_94_, L_96_forvar0, L_96_forvar0)) + L_49_) % L_45_))
					L_49_ = (L_49_ + L_48_) % L_40_
				end
				return L_95_;
			end
		}
		local function L_52_func(...)
			return {
				...
			}, L_39_('#', ...)
		end
		local function L_53_func()
			local L_97_ = {};
			local L_98_ = {};
			local L_99_ = {};
			local L_100_ = {
				L_97_,
				L_98_,
				nil,
				L_99_
			};
			local L_101_ = {}
			local L_102_ = ((305 - 204) + -#'Oder extermination services has arrived')
			local L_103_ = {
				[(-43 + (152 - 106))] = (function(L_105_arg0)
					return not(#L_105_arg0 == L_51_[(45 - 43)]())
				end),
				[(96 - 95)] = (function(L_106_arg0)
					return L_51_[(-16 + 21)]()
				end),
				[(131 - 127)] = (function(L_107_arg0)
					return L_51_[(1254 / 209)]()
				end),
				[(-#'Loris was here !' + (124 + -106))] = (function(L_108_arg0)
					local L_109_ = L_51_[(876 / 146)]()
					local L_110_ = ''
					local L_111_ = 1
					for L_112_forvar0 = 1, #L_109_ do
						L_111_ = (L_111_ + L_102_) % L_45_
						L_110_ = L_30_(L_110_, L_36_((L_8_(L_109_:sub(L_112_forvar0, L_112_forvar0)) + L_111_) % L_40_))
					end
					return L_110_
				end)
			};
			local L_104_ = L_51_[(116 + -115)]()
			for L_113_forvar0 = 1, L_104_ do
				local L_114_ = L_51_[(-#[[above is lie 0.o]] + (96 + -78))]();
				local L_115_;
				local L_116_ = L_103_[L_114_ % (-#[[Script is sponsored by: Raid shadow legends]] + (9996 / 204))];
				L_101_[L_113_forvar0] = L_116_ and L_116_({});
			end;
			for L_117_forvar0 = 1, L_51_[(36 / 36)]() do
				local L_118_ = L_51_[(58 + (-#[[java noobs when they learn every class method and keywords but they only know void because they opened eclipse with the example]] + (13277 / 187)))]();
				if (L_51_[(912 / 228)](L_118_, L_11_, L_7_) == L_34_) then
					local L_119_ = L_51_[((13145 / 239) + -#[[This file was obfuscated using PSU Obfuscator 4.0.A]])](L_118_, L_6_, L_9_);
					local L_120_ = L_51_[((2240 / 35) + -60)](L_118_, L_43_, L_6_ + L_43_);
					local L_121_ = {
						L_51_[(39 - ((10530 / 195) + -#"Hazed Is The Best!"))](),
						L_51_[(-48 + 51)](),
						nil,
						nil
					};
					local L_122_ = {
						[((198 - 151) + -#'This script is sponsored by RAID SHADOW LEGENDS')] = function()
							L_121_[L_29_] = L_51_[(119 - 116)]();
							L_121_[L_21_] = L_51_[(73 + -70)]();
						end,
						[(29 - 28)] = function()
							L_121_[L_26_] = L_51_[(-97 + 98)]();
						end,
						[(-#"watching psu beat luraph" + (4524 / 174))] = function()
							L_121_[L_26_] = L_51_[((242 - 165) + -#"Real Perth From Perth Sex Utilities PSU Perth Real 2021 April Not Clickbait?")]() - (L_6_ ^ L_38_)
						end,
						[(76 - 73)] = function()
							L_121_[L_24_] = L_51_[((177 - 148) + -#'you watched too many tiktoks')]() - (L_6_ ^ L_38_)
							L_121_[L_22_] = L_51_[(113 - 110)]();
						end
					};
					L_122_[L_119_]();
					if (L_51_[((1520 / 40) + -#"Imagine muting someone for 14 days")](L_120_, L_7_, L_11_) == L_7_) then
						L_121_[L_15_] = L_101_[L_121_[L_17_]]
					end
					if (L_51_[(-#'watching psu beat luraph' + (80 + (-#"This script is sponsored by raid: Shadow legends" + (42 + -46))))](L_120_, L_6_, L_6_) == L_11_) then
						L_121_[L_26_] = L_101_[L_121_[L_24_]]
					end
					if (L_51_[((137 - 120) + -#"constant dumB")](L_120_, L_9_, L_9_) == L_7_) then
						L_121_[L_22_] = L_101_[L_121_[L_18_]]
					end
					L_97_[L_117_forvar0] = L_121_;
				end
			end;
			for L_123_forvar0 = L_7_, L_51_[(66 / 66)]() do
				L_98_[L_123_forvar0 - L_7_] = L_53_func();
			end;
			L_100_[3] = L_51_[(82 - 80)]();
			return L_100_;
		end;
		local function L_54_func(L_124_arg0, L_125_arg1, L_126_arg2)
			local L_127_ = L_124_arg0[L_6_];
			local L_128_ = L_124_arg0[L_9_];
			local L_129_ = L_124_arg0[L_11_];
			return (function(...)
				local L_130_ = L_129_;
				local L_131_ = -L_7_;
				local L_132_ = {};
				local L_133_ = {};
				local L_134_ = L_128_;
				local L_135_ = L_127_;
				local L_136_ = {
					...
				};
				local L_137_ = L_52_func
				local L_138_ = {};
				local L_139_ = L_39_('#', ...) - L_7_;
				local L_140_ = L_11_;
				for L_144_forvar0 = 0, L_139_ do
					if (L_144_forvar0 >= L_134_) then
						L_138_[L_144_forvar0 - L_134_] = L_136_[L_144_forvar0 + L_7_];
					else
						L_133_[L_144_forvar0] = L_136_[L_144_forvar0 + L_11_];
					end;
				end;
				local L_141_ = L_139_ - L_134_ + L_11_
				local L_142_;
				local L_143_;
				while true do
					L_142_ = L_130_[L_140_];
					L_143_ = L_142_[(-#'above is lie 0.o' + (2992 / 176))];
					L_37_ = (721594)
					while (124 - 82) >= L_143_ do
						L_37_ = -L_37_
						L_37_ = (208630)
						while (64 - 44) >= L_143_ do
							L_37_ = -L_37_
							L_37_ = (6173860)
							while (1728 / 192) >= L_143_ do
								L_37_ = -L_37_
								L_37_ = (1541421)
								while (708 / 177) >= L_143_ do
									L_37_ = -L_37_
									L_37_ = (677112)
									while L_143_ <= (107 + -106) do
										L_37_ = -L_37_
										L_37_ = (1113534)
										while L_143_ > (0 / 9) do
											L_37_ = -L_37_
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_25_]] % L_142_[L_23_];
											break
										end
										while (L_37_) / ((-90 + (-#"celesmos" + (2092 - 1076)))) == 1213 do
											local L_145_;
											local L_146_;
											local L_147_;
											local L_148_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_24_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_25_]][L_142_[L_22_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_14_];
											L_147_ = L_133_[L_142_[L_24_]];
											L_133_[L_148_ + 1] = L_147_;
											L_133_[L_148_] = L_147_[L_142_[L_19_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_14_]] = L_133_[L_142_[L_26_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_17_]
											L_133_[L_148_] = L_133_[L_148_](L_44_(L_133_, L_148_ + L_11_, L_142_[L_29_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_14_];
											L_147_ = L_133_[L_142_[L_27_]];
											L_133_[L_148_ + 1] = L_147_;
											L_133_[L_148_] = L_147_[L_142_[L_19_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_17_]
											L_133_[L_148_] = L_133_[L_148_](L_133_[L_148_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_146_ = {
												L_133_,
												L_142_
											};
											L_146_[L_7_][L_146_[L_6_][L_13_]] = L_146_[L_11_][L_146_[L_6_][L_23_]] + L_146_[L_7_][L_146_[L_6_][L_25_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_133_[L_142_[L_29_]] % L_142_[L_21_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_14_]
											L_133_[L_148_] = L_133_[L_148_](L_133_[L_148_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_147_ = L_142_[L_29_];
											L_145_ = L_133_[L_147_]
											for L_149_forvar0 = L_147_ + 1, L_142_[L_19_] do
												L_145_ = L_145_ .. L_133_[L_149_forvar0];
											end;
											L_133_[L_142_[L_17_]] = L_145_;
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_146_ = {
												L_133_,
												L_142_
											};
											L_146_[L_7_][L_146_[L_6_][L_16_]] = L_146_[L_11_][L_146_[L_6_][L_18_]] + L_146_[L_7_][L_146_[L_6_][L_25_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_29_]] % L_142_[L_19_];
											break
										end;
										break;
									end
									while (L_37_) / (((-18 + 2281) - 1195)) == 634 do
										L_37_ = (516198)
										while (62 + -60) >= L_143_ do
											L_37_ = -L_37_
											if (L_133_[L_142_[L_17_]] == L_133_[L_142_[L_18_]]) then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_28_];
											end;
											break;
										end
										while (L_37_) / ((278565 / 245)) == 454 do
											L_37_ = (1242042)
											while L_143_ > (92 + -89) do
												L_37_ = -L_37_
												if (L_133_[L_142_[L_13_]] == L_133_[L_142_[L_18_]]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_24_];
												end;
												break
											end
											while (L_37_) / ((-#'llllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllll' + (945 + (72 + -111)))) == 1511 do
												local L_150_ = {
													L_133_,
													L_142_
												};
												L_150_[L_11_][L_150_[L_6_][L_12_]] = L_150_[L_6_][L_18_] + L_150_[L_6_][L_25_];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / ((999 + -96)) == 1707 do
									L_37_ = (1002456)
									while (-112 + 118) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (4112535)
										while (795 / 159) < L_143_ do
											L_37_ = -L_37_
											local L_151_ = L_142_[L_12_]
											L_133_[L_151_](L_133_[L_151_ + L_7_])
											break
										end
										while 3695 == (L_37_) / ((-42 + 1155)) do
											local L_152_ = L_142_[L_15_]
											L_133_[L_152_](L_44_(L_133_, L_152_ + L_7_, L_131_))
											break
										end;
										break;
									end
									while 1989 == (L_37_) / (((88387 / 169) + -#[[raid shadow legends]])) do
										L_37_ = (1355160)
										while L_143_ <= (108 - 101) do
											L_37_ = -L_37_
											local L_153_ = {
												L_133_,
												L_142_
											};
											L_153_[L_7_][L_153_[L_6_][L_16_]] = L_153_[L_11_][L_153_[L_6_][L_18_]] + L_153_[L_7_][L_153_[L_6_][L_28_]];
											break;
										end
										while (L_37_) / ((1537 + -64)) == 920 do
											L_37_ = (3834502)
											while L_143_ > (55 + -47) do
												L_37_ = -L_37_
												local L_154_ = L_142_[L_15_]
												L_133_[L_154_] = L_133_[L_154_](L_44_(L_133_, L_154_ + L_11_, L_142_[L_28_]))
												break
											end
											while 1106 == (L_37_) / ((-60 + ((3541 / 1) + -#'int 21h on top'))) do
												if (L_133_[L_142_[L_17_]] == L_142_[L_21_]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_25_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while 2321 == (L_37_) / ((627760 / (-#[[This script is sponsore by RAID: Shadow Legends]] + (601 - 318)))) do
								L_37_ = (1180800)
								while L_143_ <= (41 + -27) do
									L_37_ = -L_37_
									L_37_ = (11025404)
									while L_143_ <= (98 - 87) do
										L_37_ = -L_37_
										L_37_ = (1750777)
										while (1160 / 116) < L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_12_]][L_133_[L_142_[L_28_]]] = L_133_[L_142_[L_20_]];
											break
										end
										while 3733 == (L_37_) / ((61908 / 132)) do
											L_133_[L_142_[L_13_]] = L_133_[L_142_[L_27_]];
											break
										end;
										break;
									end
									while 3874 == (L_37_) / ((2877 + -31)) do
										L_37_ = (6216496)
										while ((143 + -122) + -#'.prune 15') >= L_143_ do
											L_37_ = -L_37_
											local L_155_ = L_142_[L_14_];
											local L_156_ = L_133_[L_155_ + 2];
											local L_157_ = L_133_[L_155_] + L_156_;
											L_133_[L_155_] = L_157_;
											if (L_156_ > 0) then
												if (L_157_ <= L_133_[L_155_ + 1]) then
													L_140_ = L_142_[L_24_];
													L_133_[L_155_ + 3] = L_157_;
												end
											elseif (L_157_ >= L_133_[L_155_ + 1]) then
												L_140_ = L_142_[L_26_];
												L_133_[L_155_ + 3] = L_157_;
											end
											break;
										end
										while 1936 == (L_37_) / ((6473 - 3262)) do
											L_37_ = (404800)
											while L_143_ > (119 + -106) do
												L_37_ = -L_37_
												L_133_[L_142_[L_15_]] = L_125_arg1[L_142_[L_27_]];
												break
											end
											while 110 == (L_37_) / ((-73 + 3753)) do
												local L_158_ = L_142_[L_12_];
												local L_159_ = L_133_[L_158_ + 2];
												local L_160_ = L_133_[L_158_] + L_159_;
												L_133_[L_158_] = L_160_;
												if (L_159_ > 0) then
													if (L_160_ <= L_133_[L_158_ + 1]) then
														L_140_ = L_142_[L_29_];
														L_133_[L_158_ + 3] = L_160_;
													end
												elseif (L_160_ >= L_133_[L_158_ + 1]) then
													L_140_ = L_142_[L_28_];
													L_133_[L_158_ + 3] = L_160_;
												end
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 3075 == (L_37_) / ((-20 + 404)) do
									L_37_ = (5269380)
									while L_143_ <= ((31031 / 217) - 126) do
										L_37_ = -L_37_
										L_37_ = (11864916)
										while L_143_ <= (-30 + 45) do
											L_37_ = -L_37_
											L_133_[L_142_[L_17_]] = L_133_[L_142_[L_25_]] - L_133_[L_142_[L_19_]];
											break;
										end
										while (L_37_) / (((1318443 - 659281) / 197)) == 3546 do
											L_37_ = (236912)
											while L_143_ > (130 - 114) do
												L_37_ = -L_37_
												L_133_[L_142_[L_12_]] = (L_142_[L_24_] ~= 0);
												break
											end
											while (L_37_) / ((361 + -89)) == 871 do
												local L_161_ = L_133_[L_142_[L_18_]];
												if not L_161_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_13_]] = L_161_;
													L_140_ = L_142_[L_27_];
												end;
												break
											end;
											break;
										end
										break;
									end
									while 1860 == (L_37_) / ((5777 - 2944)) do
										L_37_ = (8815364)
										while ((-103 + 205) + -#[[llllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllll]]) >= L_143_ do
											L_37_ = -L_37_
											if not L_133_[L_142_[L_14_]] then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_27_];
											end;
											break;
										end
										while (L_37_) / ((441952 / 112)) == 2234 do
											L_37_ = (1336236)
											while L_143_ > ((-52 + 87) + -#'peptskull is hot') do
												L_37_ = -L_37_
												L_140_ = L_142_[L_28_];
												break
											end
											while (L_37_) / ((-56 + 2348)) == 583 do
												L_133_[L_142_[L_12_]][L_133_[L_142_[L_24_]]] = L_133_[L_142_[L_23_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						while (L_37_) / ((-73 + 1419)) == 155 do
							L_37_ = (9816984)
							while (-#"Skids when they learn variables: Oh you know lua? Name every variable" + (25200 / 252)) >= L_143_ do
								L_37_ = -L_37_
								L_37_ = (167619)
								while (200 / 8) >= L_143_ do
									L_37_ = -L_37_
									L_37_ = (1989820)
									while (3828 / 174) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (1516504)
										while L_143_ > ((10640 / (333 - 181)) + -#'Slowmode is enabled, but you are immune. Amazing!') do
											L_37_ = -L_37_
											local L_162_ = {
												L_133_,
												L_142_
											};
											L_162_[L_11_][L_162_[L_6_][L_17_]] = L_162_[L_6_][L_20_] + L_162_[L_6_][L_25_];
											break
										end
										while (L_37_) / (((-204 + 83) + 1028)) == 1672 do
											local L_163_ = L_135_[L_142_[L_25_]];
											local L_164_;
											local L_165_ = {};
											L_164_ = L_32_({}, {
												__index = function(L_166_arg0, L_167_arg1)
													local L_168_ = L_165_[L_167_arg1];
													return L_168_[1][L_168_[2]];
												end,
												__newindex = function(L_169_arg0, L_170_arg1, L_171_arg2)
													local L_172_ = L_165_[L_170_arg1]
													L_172_[1][L_172_[2]] = L_171_arg2;
												end;
											});
											for L_173_forvar0 = 1, L_142_[L_21_] do
												L_140_ = L_140_ + L_7_;
												local L_174_ = L_130_[L_140_];
												if L_174_[(-38 + 39)] == 10 then
													L_165_[L_173_forvar0 - 1] = {
														L_133_,
														L_174_[L_29_]
													};
												else
													L_165_[L_173_forvar0 - 1] = {
														L_125_arg1,
														L_174_[L_28_]
													};
												end;
												L_132_[#L_132_ + 1] = L_165_;
											end;
											L_133_[L_142_[L_17_]] = L_54_func(L_163_, L_164_, L_126_arg2);
											break
										end;
										break;
									end
									while (L_37_) / ((2241 + (-24592 / 232))) == 932 do
										L_37_ = (4887072)
										while L_143_ <= ((161 + -110) + -#'you watched too many tiktoks') do
											L_37_ = -L_37_
											L_133_[L_142_[L_14_]] = #L_133_[L_142_[L_26_]];
											break;
										end
										while 1704 == (L_37_) / ((-#'Not approved by the NSC(National Skid Corparation)' + (5916 - 2998))) do
											L_37_ = (1477980)
											while L_143_ > (-96 + 120) do
												L_37_ = -L_37_
												do
													return L_133_[L_142_[L_15_]]
												end
												break
											end
											while (L_37_) / ((1946 + -110)) == 805 do
												L_126_arg2[L_142_[L_24_]] = L_133_[L_142_[L_14_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / (((-33 + 222) + -#'Psu was here')) == 947 do
									L_37_ = (13293489)
									while L_143_ <= (144 - 116) do
										L_37_ = -L_37_
										L_37_ = (606150)
										while ((73710 / 27) / 105) >= L_143_ do
											L_37_ = -L_37_
											L_125_arg1[L_142_[L_28_]] = L_133_[L_142_[L_13_]];
											break;
										end
										while (L_37_) / ((59670 / 221)) == 2245 do
											L_37_ = (1383525)
											while L_143_ > (64 + -37) do
												L_37_ = -L_37_
												if L_133_[L_142_[L_17_]] then
													L_140_ = L_140_ + L_11_;
												else
													L_140_ = L_142_[L_24_];
												end;
												break
											end
											while (L_37_) / ((2069 - 1094)) == 1419 do
												L_133_[L_142_[L_15_]] = #L_133_[L_142_[L_26_]];
												break
											end;
											break;
										end
										break;
									end
									while 3911 == (L_37_) / (((3469 + -58) + -#"bindgus drip")) do
										L_37_ = (6435840)
										while L_143_ <= (-99 + 128) do
											L_37_ = -L_37_
											local L_175_;
											local L_176_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_25_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_17_]] = L_142_[L_29_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_176_ = L_142_[L_17_]
											L_133_[L_176_] = L_133_[L_176_](L_44_(L_133_, L_176_ + L_11_, L_142_[L_24_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_24_]][L_133_[L_142_[L_23_]]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_176_ = L_142_[L_15_]
											L_133_[L_176_] = L_133_[L_176_](L_133_[L_176_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_175_ = L_133_[L_142_[L_18_]];
											if not L_175_ then
												L_140_ = L_140_ + L_7_;
											else
												L_133_[L_142_[L_14_]] = L_175_;
												L_140_ = L_142_[L_27_];
											end;
											break;
										end
										while (L_37_) / ((-#[[is managing ip info on the client and sending it directly to a discord webhook really a whitelist purpose? (hint: vapin cat)]] + (291600 / 162))) == 3840 do
											L_37_ = (127755)
											while (87 - 57) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_14_]] = L_142_[L_29_];
												break
											end
											while 255 == (L_37_) / (((1058 - 537) + -#'Goodness Gracious Me')) do
												L_133_[L_142_[L_16_]] = L_133_[L_142_[L_27_]][L_142_[L_18_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / ((-#"Whxted was here B)" + (265824 / 104))) == 3868 do
								L_37_ = (2107695)
								while ((12608 / 197) + -#'i wish my dad still loved me') >= L_143_ do
									L_37_ = -L_37_
									L_37_ = (274071)
									while (117 - 84) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (1456580)
										while L_143_ > (4672 / 146) do
											L_37_ = -L_37_
											L_125_arg1[L_142_[L_27_]] = L_133_[L_142_[L_12_]];
											break
										end
										while (L_37_) / ((-#"stOP READING MY CODE!" + (133895 / 61))) == 670 do
											do
												return
											end;
											break
										end;
										break;
									end
									while (L_37_) / ((83779 / 199)) == 651 do
										L_37_ = (85870)
										while L_143_ <= ((161 - 93) + -#'Imagine muting someone for 14 days') do
											L_37_ = -L_37_
											local L_177_ = L_142_[L_12_]
											L_133_[L_177_](L_133_[L_177_ + L_7_])
											break;
										end
										while 1385 == (L_37_) / (((10752 / 96) + -50)) do
											L_37_ = (7866067)
											while ((-22 + 73) + -#"Pogfish was here") < L_143_ do
												L_37_ = -L_37_
												local L_178_ = L_142_[L_25_];
												local L_179_ = L_133_[L_178_]
												for L_180_forvar0 = L_178_ + 1, L_142_[L_18_] do
													L_179_ = L_179_ .. L_133_[L_180_forvar0];
												end;
												L_133_[L_142_[L_15_]] = L_179_;
												break
											end
											while 2893 == (L_37_) / ((239272 / 88)) do
												if L_133_[L_142_[L_12_]] then
													L_140_ = L_140_ + L_11_;
												else
													L_140_ = L_142_[L_25_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / ((3798 - 1941)) == 1135 do
									L_37_ = (6322822)
									while L_143_ <= (4173 / (238 - 131)) do
										L_37_ = -L_37_
										L_37_ = (2463700)
										while L_143_ <= (193 - 156) do
											L_37_ = -L_37_
											L_140_ = L_142_[L_25_];
											break;
										end
										while 1388 == (L_37_) / ((-46 + 1821)) do
											L_37_ = (7746024)
											while (3116 / 82) < L_143_ do
												L_37_ = -L_37_
												local L_181_ = L_142_[L_17_];
												local L_182_ = L_133_[L_181_]
												local L_183_ = L_133_[L_181_ + 2];
												if (L_183_ > 0) then
													if (L_182_ > L_133_[L_181_ + 1]) then
														L_140_ = L_142_[L_26_];
													else
														L_133_[L_181_ + 3] = L_182_;
													end
												elseif (L_182_ < L_133_[L_181_ + 1]) then
													L_140_ = L_142_[L_29_];
												else
													L_133_[L_181_ + 3] = L_182_;
												end
												break
											end
											while 1924 == (L_37_) / ((615978 / 153)) do
												L_133_[L_142_[L_14_]] = (L_142_[L_24_] ~= 0);
												L_140_ = L_140_ + L_7_;
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / ((-#"amog us" + (-69 + 4013))) == 1606 do
										L_37_ = (1841875)
										while L_143_ <= (4360 / 109) do
											L_37_ = -L_37_
											local L_184_ = L_135_[L_142_[L_25_]];
											local L_185_;
											local L_186_ = {};
											L_185_ = L_32_({}, {
												__index = function(L_187_arg0, L_188_arg1)
													local L_189_ = L_186_[L_188_arg1];
													return L_189_[1][L_189_[2]];
												end,
												__newindex = function(L_190_arg0, L_191_arg1, L_192_arg2)
													local L_193_ = L_186_[L_191_arg1]
													L_193_[1][L_193_[2]] = L_192_arg2;
												end;
											});
											for L_194_forvar0 = 1, L_142_[L_19_] do
												L_140_ = L_140_ + L_7_;
												local L_195_ = L_130_[L_140_];
												if L_195_[((131 - 82) + -#"This script is sponsored by RAID: Shadow legends")] == 10 then
													L_186_[L_194_forvar0 - 1] = {
														L_133_,
														L_195_[L_29_]
													};
												else
													L_186_[L_194_forvar0 - 1] = {
														L_125_arg1,
														L_195_[L_27_]
													};
												end;
												L_132_[#L_132_ + 1] = L_186_;
											end;
											L_133_[L_142_[L_12_]] = L_54_func(L_184_, L_185_, L_126_arg2);
											break;
										end
										while 625 == (L_37_) / ((3033 + -86)) do
											L_37_ = (4809644)
											while (-20 + 61) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_13_]] = (L_142_[L_26_] ~= 0);
												L_140_ = L_140_ + L_7_;
												break
											end
											while (L_37_) / ((6596 - 3355)) == 1484 do
												local L_196_;
												L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_28_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_15_]] = L_126_arg2[L_142_[L_29_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_14_]] = L_142_[L_26_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_16_]] = L_142_[L_27_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = L_142_[L_29_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_196_ = L_142_[L_13_]
												L_133_[L_196_] = L_133_[L_196_](L_44_(L_133_, L_196_ + L_11_, L_142_[L_25_]))
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_133_[L_142_[L_29_]][L_133_[L_142_[L_20_]]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_14_]] = L_125_arg1[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_196_ = L_142_[L_14_]
												L_133_[L_196_] = L_133_[L_196_](L_133_[L_196_ + L_7_])
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_125_arg1[L_142_[L_27_]] = L_133_[L_142_[L_15_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												do
													return
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						break;
					end
					while 842 == (L_37_) / ((51420 / 60)) do
						L_37_ = (12574985)
						while L_143_ <= (102 + -39) do
							L_37_ = -L_37_
							L_37_ = (2542000)
							while (-#[[This script is sponsored by RAID: Shadow legends]] + (321 - 221)) >= L_143_ do
								L_37_ = -L_37_
								L_37_ = (5700846)
								while L_143_ <= ((3675 / 49) + -#"Yeah this is getting cringe-") do
									L_37_ = -L_37_
									L_37_ = (2752038)
									while L_143_ <= (5236 / 119) do
										L_37_ = -L_37_
										L_37_ = (3035109)
										while ((107 + -46) + -#[[Whxted was here B)]]) < L_143_ do
											L_37_ = -L_37_
											local L_197_ = L_142_[L_26_];
											local L_198_ = L_133_[L_197_]
											for L_199_forvar0 = L_197_ + 1, L_142_[L_20_] do
												L_198_ = L_198_ .. L_133_[L_199_forvar0];
											end;
											L_133_[L_142_[L_16_]] = L_198_;
											break
										end
										while (L_37_) / ((3771 - 1894)) == 1617 do
											if (L_133_[L_142_[L_15_]] ~= L_133_[L_142_[L_22_]]) then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_27_];
											end;
											break
										end;
										break;
									end
									while (L_37_) / ((6632 - 3379)) == 846 do
										L_37_ = (5550874)
										while (132 - 87) >= L_143_ do
											L_37_ = -L_37_
											local L_200_ = L_142_[L_13_];
											local L_201_ = L_133_[L_142_[L_28_]];
											L_133_[L_200_ + 1] = L_201_;
											L_133_[L_200_] = L_201_[L_142_[L_21_]];
											break;
										end
										while (L_37_) / ((5734 - 2912)) == 1967 do
											L_37_ = (10047477)
											while (146 + -100) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_16_]] = L_133_[L_142_[L_25_]] % L_142_[L_20_];
												break
											end
											while 2937 == (L_37_) / (((-87 + 3533) + -#"psu unmerged from MS when")) do
												L_133_[L_142_[L_16_]] = {};
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 2859 == (L_37_) / ((4024 - 2030)) do
									L_37_ = (2300562)
									while L_143_ <= (69 + ((9702 / 154) + -#[[bitch why you acting sus why you acting like imposter why you acting like a monster]])) do
										L_37_ = -L_37_
										L_37_ = (1113191)
										while (7632 / (-#"Bruh How Are You Immune To Slowmode" + (470 - 276))) < L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_14_]] = L_54_func(L_135_[L_142_[L_29_]], nil, L_126_arg2);
											break
										end
										while (L_37_) / (((2918 - 1484) + -#'haxor')) == 779 do
											local L_202_;
											local L_203_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_142_[L_29_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_26_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_203_ = L_142_[L_28_];
											L_202_ = L_133_[L_203_]
											for L_204_forvar0 = L_203_ + 1, L_142_[L_18_] do
												L_202_ = L_202_ .. L_133_[L_204_forvar0];
											end;
											L_133_[L_142_[L_14_]] = L_202_;
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											if not L_133_[L_142_[L_12_]] then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_24_];
											end;
											break
										end;
										break;
									end
									while 3873 == (L_37_) / (((-#"Haram channel" + (-109 + 1377)) - 661)) do
										L_37_ = (135681)
										while L_143_ <= (136 - 86) do
											L_37_ = -L_37_
											local L_205_;
											local L_206_, L_207_;
											local L_208_;
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_26_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_28_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_26_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_208_ = L_142_[L_14_]
											L_206_, L_207_ = L_137_(L_133_[L_208_](L_44_(L_133_, L_208_ + 1, L_142_[L_25_])))
											L_131_ = L_207_ + L_208_ - 1
											L_205_ = 0;
											for L_209_forvar0 = L_208_, L_131_ do
												L_205_ = L_205_ + L_11_;
												L_133_[L_209_forvar0] = L_206_[L_205_];
											end;
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_208_ = L_142_[L_16_]
											L_133_[L_208_](L_44_(L_133_, L_208_ + L_7_, L_131_))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											do
												return
											end;
											break;
										end
										while 147 == (L_37_) / ((-55 + 978)) do
											L_37_ = (7774620)
											while L_143_ > (130 - 79) do
												L_37_ = -L_37_
												if not L_133_[L_142_[L_13_]] then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_26_];
												end;
												break
											end
											while 2595 == (L_37_) / (((6118 - 3117) + -#'brueh')) do
												local L_210_;
												local L_211_;
												L_133_[L_142_[L_14_]] = (L_142_[L_26_] ~= 0);
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = L_133_[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = L_126_arg2[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_211_ = L_142_[L_16_]
												L_133_[L_211_] = L_133_[L_211_](L_133_[L_211_ + L_7_])
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_210_ = L_133_[L_142_[L_20_]];
												if not L_210_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_15_]] = L_210_;
													L_140_ = L_142_[L_28_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / ((1583 - 808)) == 3280 do
								L_37_ = (380982)
								while L_143_ <= (-#'19 dollar PSU premium! And yes, im giving it away!' + (1391 / 13)) do
									L_37_ = -L_37_
									L_37_ = (7692721)
									while (-#'nice executor bro. 2 HttpGets crash it..' + (5734 / 61)) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (6415734)
										while L_143_ > (-#"19 dollar moonsec card! And yes, im giving it away!" + (260 - 156)) do
											L_37_ = -L_37_
											local L_212_ = L_142_[L_15_]
											L_133_[L_212_] = L_133_[L_212_](L_133_[L_212_ + L_7_])
											break
										end
										while (L_37_) / ((174798 / 54)) == 1982 do
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_26_]][L_133_[L_142_[L_20_]]];
											break
										end;
										break;
									end
									while 2533 == (L_37_) / ((3084 + -47)) do
										L_37_ = (3012856)
										while ((150 - 87) + -#"celesmos") >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_17_]] = L_126_arg2[L_142_[L_27_]];
											break;
										end
										while (L_37_) / ((-#"ThatExclamationMarkGuy was here" + (6612 - 3369))) == 938 do
											L_37_ = (5256720)
											while (7672 / 137) < L_143_ do
												L_37_ = -L_37_
												do
													return
												end;
												break
											end
											while (L_37_) / ((4492 - 2287)) == 2384 do
												local L_213_ = L_142_[L_12_]
												L_133_[L_213_] = L_133_[L_213_](L_133_[L_213_ + L_7_])
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / ((71910 / 255)) == 1351 do
									L_37_ = (6615420)
									while L_143_ <= ((153 + -87) + -#[[no lol]]) do
										L_37_ = -L_37_
										L_37_ = (2984384)
										while (10904 / 188) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_13_]] = L_133_[L_142_[L_27_]];
											break;
										end
										while 3536 == (L_37_) / (((1816 - 958) + -#"WendyWasHere:)")) do
											L_37_ = (8391657)
											while (-#'imagine sending a crash video without any warning and thinking its funny' + (382 - 251)) < L_143_ do
												L_37_ = -L_37_
												if (L_133_[L_142_[L_14_]] ~= L_133_[L_142_[L_23_]]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_24_];
												end;
												break
											end
											while (L_37_) / ((2838 + -51)) == 3011 do
												L_133_[L_142_[L_14_]] = L_125_arg1[L_142_[L_24_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = #L_133_[L_142_[L_26_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_125_arg1[L_142_[L_24_]] = L_133_[L_142_[L_14_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_125_arg1[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = #L_133_[L_142_[L_27_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_125_arg1[L_142_[L_27_]] = L_133_[L_142_[L_15_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												do
													return
												end;
												break
											end;
											break;
										end
										break;
									end
									while 1995 == (L_37_) / (((3358 + -17) + -#'my pp got hard for my mom')) do
										L_37_ = (7826349)
										while (915 / 15) >= L_143_ do
											L_37_ = -L_37_
											local L_214_;
											local L_215_;
											local L_216_;
											L_133_[L_142_[L_17_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = #L_133_[L_142_[L_27_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_17_]] = L_142_[L_29_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_216_ = L_142_[L_13_];
											L_215_ = L_133_[L_216_]
											L_214_ = L_133_[L_216_ + 2];
											if (L_214_ > 0) then
												if (L_215_ > L_133_[L_216_ + 1]) then
													L_140_ = L_142_[L_28_];
												else
													L_133_[L_216_ + 3] = L_215_;
												end
											elseif (L_215_ < L_133_[L_216_ + 1]) then
												L_140_ = L_142_[L_28_];
											else
												L_133_[L_216_ + 3] = L_215_;
											end
											break;
										end
										while 3037 == (L_37_) / ((5211 - 2634)) do
											L_37_ = (11435831)
											while (-#'Oh so your a skid? Whats the best obfuscator' + (6572 / 62)) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_12_]] = {};
												break
											end
											while 3509 == (L_37_) / (((3414 + -107) + -#'This script is sponsored by raid: Shadow legends')) do
												local L_217_ = L_142_[L_15_];
												local L_218_ = L_133_[L_142_[L_24_]];
												L_133_[L_217_ + 1] = L_218_;
												L_133_[L_217_] = L_218_[L_142_[L_22_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						while 3095 == (L_37_) / ((8188 - (8269 - 4144))) do
							L_37_ = (4100616)
							while L_143_ <= ((2523 / 29) + -#"constant dumB") do
								L_37_ = -L_37_
								L_37_ = (9101190)
								while L_143_ <= ((19434 / 79) - 178) do
									L_37_ = -L_37_
									L_37_ = (6168264)
									while L_143_ <= (240 - 175) do
										L_37_ = -L_37_
										L_37_ = (10627545)
										while (14976 / 234) < L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_17_]] = L_54_func(L_135_[L_142_[L_25_]], nil, L_126_arg2);
											break
										end
										while 3671 == (L_37_) / ((-#"This script is sponsored by raid: Shadow legends" + (406134 / 138))) do
											local L_219_;
											local L_220_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_24_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_142_[L_25_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_14_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_220_ = L_142_[L_17_]
											L_133_[L_220_] = L_133_[L_220_](L_44_(L_133_, L_220_ + L_11_, L_142_[L_28_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_27_]][L_133_[L_142_[L_19_]]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_220_ = L_142_[L_15_]
											L_133_[L_220_] = L_133_[L_220_](L_133_[L_220_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_219_ = L_133_[L_142_[L_18_]];
											if not L_219_ then
												L_140_ = L_140_ + L_7_;
											else
												L_133_[L_142_[L_13_]] = L_219_;
												L_140_ = L_142_[L_27_];
											end;
											break
										end;
										break;
									end
									while (L_37_) / (((6847 + -58) - 3453)) == 1849 do
										L_37_ = (8411844)
										while ((((1322 - 705) + -#[[When your robux gets stolen by kids pretending to be a BLM group]]) / 7) + -#"px1 is so hot") >= L_143_ do
											L_37_ = -L_37_
											local L_221_;
											L_133_[L_142_[L_17_]] = L_126_arg2[L_142_[L_29_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_26_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_26_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_14_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_221_ = L_142_[L_12_]
											L_133_[L_221_] = L_133_[L_221_](L_44_(L_133_, L_221_ + L_11_, L_142_[L_27_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_26_]][L_133_[L_142_[L_18_]]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_221_ = L_142_[L_13_]
											L_133_[L_221_] = L_133_[L_221_](L_133_[L_221_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_17_]] = L_133_[L_142_[L_24_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_140_ = L_142_[L_29_];
											break;
										end
										while 3346 == (L_37_) / ((2629 + -115)) do
											L_37_ = (6262596)
											while (-#'Whxted was here B)' + (-100 + 185)) < L_143_ do
												L_37_ = -L_37_
												local L_222_ = L_142_[L_13_]
												L_133_[L_222_] = L_133_[L_222_](L_44_(L_133_, L_222_ + L_11_, L_142_[L_28_]))
												break
											end
											while 3411 == (L_37_) / ((1920 + -84)) do
												local L_223_ = L_133_[L_142_[L_22_]];
												if not L_223_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_14_]] = L_223_;
													L_140_ = L_142_[L_29_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 3990 == (L_37_) / ((-#'peptskull looks like an avocado had fun with an older more disgusting avocado' + (54234 / 23))) do
									L_37_ = (6928209)
									while L_143_ <= (5467 / 77) do
										L_37_ = -L_37_
										L_37_ = (3265080)
										while (17319 / ((-115 + 390) + -#[[moonsec > all (froggers)]])) >= L_143_ do
											L_37_ = -L_37_
											local L_224_ = L_142_[L_12_]
											local L_225_, L_226_ = L_137_(L_133_[L_224_](L_44_(L_133_, L_224_ + 1, L_142_[L_25_])))
											L_131_ = L_226_ + L_224_ - 1
											local L_227_ = 0;
											for L_228_forvar0 = L_224_, L_131_ do
												L_227_ = L_227_ + L_11_;
												L_133_[L_228_forvar0] = L_225_[L_227_];
											end;
											break;
										end
										while 1820 == (L_37_) / ((3692 - 1898)) do
											L_37_ = (1103862)
											while (201 - 131) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_15_]] = (L_142_[L_29_] ~= 0);
												break
											end
											while 437 == (L_37_) / ((-#"table.concat = nil" + (5189 - 2645))) do
												L_126_arg2[L_142_[L_28_]] = L_133_[L_142_[L_13_]];
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / (((6015 - (505395 / 165)) + -#[[my pp got hard for my mom]])) == 2367 do
										L_37_ = (1533508)
										while L_143_ <= (214 - 142) do
											L_37_ = -L_37_
											do
												return L_133_[L_142_[L_14_]]
											end
											break;
										end
										while (L_37_) / ((-#"Psu was here" + (2710 + -125))) == 596 do
											L_37_ = (1605072)
											while L_143_ > (152 + -79) do
												L_37_ = -L_37_
												local L_229_;
												local L_230_;
												L_133_[L_142_[L_17_]] = L_126_arg2[L_142_[L_26_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_15_]] = L_126_arg2[L_142_[L_26_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = L_142_[L_25_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_14_]] = L_142_[L_28_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_142_[L_24_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_230_ = L_142_[L_16_]
												L_133_[L_230_] = L_133_[L_230_](L_44_(L_133_, L_230_ + L_11_, L_142_[L_28_]))
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = L_133_[L_142_[L_29_]][L_133_[L_142_[L_20_]]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_230_ = L_142_[L_17_]
												L_133_[L_230_] = L_133_[L_230_](L_133_[L_230_ + L_7_])
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_229_ = L_133_[L_142_[L_22_]];
												if not L_229_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_13_]] = L_229_;
													L_140_ = L_142_[L_25_];
												end;
												break
											end
											while 1904 == (L_37_) / (((-124 + 27) + 940)) do
												L_133_[L_142_[L_14_]] = L_133_[L_142_[L_24_]][L_133_[L_142_[L_19_]]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / ((-110 + 1124)) == 4044 do
								L_37_ = (3740160)
								while L_143_ <= (15563 / 197) do
									L_37_ = -L_37_
									L_37_ = (16112027)
									while (-#'19 dollar fortnite card! And yes, im giving it away!' + (-124 + 252)) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (5650248)
										while L_143_ > (240 - 165) do
											L_37_ = -L_37_
											L_133_[L_142_[L_13_]] = L_133_[L_142_[L_24_]] - L_133_[L_142_[L_20_]];
											break
										end
										while 1866 == (L_37_) / ((772140 / 255)) do
											local L_231_ = {
												L_133_,
												L_142_
											};
											L_231_[L_7_][L_231_[L_6_][L_12_]] = L_231_[L_11_][L_231_[L_6_][L_21_]] + L_231_[L_7_][L_231_[L_6_][L_25_]];
											break
										end;
										break;
									end
									while 4027 == (L_37_) / ((992248 / 248)) do
										L_37_ = (10030194)
										while (1540 / (440 / 22)) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_25_]][L_142_[L_22_]];
											break;
										end
										while 3114 == (L_37_) / ((389741 / 121)) do
											L_37_ = (489060)
											while L_143_ > (275 - 197) do
												L_37_ = -L_37_
												local L_232_ = L_142_[L_14_]
												L_133_[L_232_](L_44_(L_133_, L_232_ + L_7_, L_131_))
												break
											end
											while 429 == (L_37_) / (((2406 - 1215) + -#'This file was obfuscated using PSU Obfuscator 4.0.A')) do
												local L_233_ = L_142_[L_12_];
												local L_234_ = L_133_[L_233_]
												local L_235_ = L_133_[L_233_ + 2];
												if (L_235_ > 0) then
													if (L_234_ > L_133_[L_233_ + 1]) then
														L_140_ = L_142_[L_26_];
													else
														L_133_[L_233_ + 3] = L_234_;
													end
												elseif (L_234_ < L_133_[L_233_ + 1]) then
													L_140_ = L_142_[L_24_];
												else
													L_133_[L_233_ + 3] = L_234_;
												end
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 1948 == (L_37_) / (((427635 / 221) + -#[[MasonYT is cool]])) do
									L_37_ = (6361478)
									while L_143_ <= (20828 / 254) do
										L_37_ = -L_37_
										L_37_ = (74340)
										while (1200 / 15) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_14_]] = L_142_[L_26_];
											break;
										end
										while (L_37_) / ((348572 / 211)) == 45 do
											L_37_ = (5556996)
											while L_143_ > ((-110 + 220) + -29) do
												L_37_ = -L_37_
												local L_236_ = L_142_[L_16_]
												local L_237_, L_238_ = L_137_(L_133_[L_236_](L_44_(L_133_, L_236_ + 1, L_142_[L_27_])))
												L_131_ = L_238_ + L_236_ - 1
												local L_239_ = 0;
												for L_240_forvar0 = L_236_, L_131_ do
													L_239_ = L_239_ + L_11_;
													L_133_[L_240_forvar0] = L_237_[L_239_];
												end;
												break
											end
											while 2841 == (L_37_) / ((-79 + 2035)) do
												L_133_[L_142_[L_17_]] = L_125_arg1[L_142_[L_29_]];
												break
											end;
											break;
										end
										break;
									end
									while 1886 == (L_37_) / ((-58 + 3431)) do
										L_37_ = (1161984)
										while L_143_ <= (18260 / 220) do
											L_37_ = -L_37_
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_29_]];
											break;
										end
										while (L_37_) / ((-#'You know math? sqrt(-2) * sqrt(-32) = ??' + (21760 / 10))) == 544 do
											L_37_ = (3117204)
											while (15372 / 183) < L_143_ do
												L_37_ = -L_37_
												L_126_arg2[L_142_[L_26_]] = L_133_[L_142_[L_13_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = {};
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = {};
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_126_arg2[L_142_[L_29_]] = L_133_[L_142_[L_14_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_27_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												if (L_133_[L_142_[L_14_]] == L_142_[L_20_]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_27_];
												end;
												break
											end
											while (L_37_) / ((-#[[Haram channel]] + (544203 / 253))) == 1458 do
												if (L_133_[L_142_[L_15_]] == L_142_[L_19_]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_26_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						break;
					end
					L_140_ = L_140_ + L_11_;
				end;
			end);
		end;
		return L_54_func(L_53_func(), {}, L_4_())()
	end)
	_msec({
		[((16585 / 107) + -#[[ok 1 2 3 XDDD]])] = '\115\116' .. (function(L_241_arg0)
			return (L_241_arg0 and '؃ؠ؃ؠدجنټآضئض') or '\114\105' or '\120\58'
		end)(((-120 + 145) + -#"Goodness Gracious Me") == (1350 / 225)) .. '\110g',
		["ڝسققآنڝؠؠضقك"] = '\108\100' .. (function(L_242_arg0)
			return (L_242_arg0 and 'ڪجڝزڪئججسڪڪكضق') or '\101\120' or '\119\111'
		end)((-#'poopy pants' + (102 + -86)) == ((144 - 110) + -#[[Yeah this is getting cringe-]])) .. '\112',
		["ڪڝآ؃قدكقق"] = (function(L_243_arg0)
			return (L_243_arg0 and 'زڝكضټزججآق؃قزنڝ') and '\98\121' or '\100\120'
		end)((595 / 119) == (-#"psu on top :)" + (124 - 106))) .. '\116\101',
		["ڝح؃سآټجټؠ"] = '\99' .. (function(L_244_arg0)
			return (L_244_arg0 and 'د؃سنټقڝقسحټ') and '\90\19\157' or '\104\97'
		end)(((5000 / 200) + -#"kill all men!1111!!!") == (477 / 159)) .. '\114',
		[(((-#"Flux Sus !!! flushed" + (4832216 / 34)) / 248) + -#'stOP READING MY CODE!')] = '\116\97' .. (function(L_245_arg0)
			return (L_245_arg0 and 'ؠدؠزنټآقضدقجسزضڝ') and '\64\113' or '\98\108'
		end)((1236 / 206) == (78 - 73)) .. '\101',
		["جكضكجئڝسڝ"] = (function(L_246_arg0)
			return (L_246_arg0 and 'قدكضآقجججدزټ') or '\115\117' or '\78\107'
		end)((22 + -19) == (-#'psu more like bad <:troll:814713569169768448>' + (7904 / 104))) .. '\98',
		["ؠآدزڝدآسجكڪحضټكضئآز"] = '\99\111' .. (function(L_247_arg0)
			return (L_247_arg0 and 'حئڝټجزڝئقحسټئ') and '\110\99' or '\110\105\103\97'
		end)((7130 / 230) == (-#[[my pp got hard for my mom]] + (187 - 131))) .. '\97\116',
		[(-#'Oh you you know lua? Name every metamethod' + (23426 / 34))] = (function(L_248_arg0, L_249_arg1)
			return (L_248_arg0 and 'ككآدؠڪآټؠس') and '\48\159\158\188\10' or '\109\97'
		end)((-72 + (255 - 178)) == ((59 - 39) + -#'WendyWasHere:)')) .. '\116\104',
		[(263445 / (492 - 297))] = (function(L_250_arg0, L_251_arg1)
			return (((-94 + 150) + -#'This file was obfuscated using PSU Obfuscator 4.0.A') == (297 / 99) and '\48' .. '\195' or L_250_arg0 .. ((not'\20\95\69' and '\90' .. '\180' or L_251_arg1))) or '\199\203\95'
		end),
		["؃ددكدڝسسضز؃حڪئ"] = '\105\110' .. (function(L_252_arg0, L_253_arg1)
			return (L_252_arg0 and 'ڪئكټدججؠ؃ضڝنح؃ڝزجكڪ') and '\90\115\138\115\15' or '\115\101'
		end)((63 - 58) == (5673 / 183)) .. '\114\116',
		["حقټجحججج؃آسزسجڝدنز"] = '\117\110' .. (function(L_254_arg0, L_255_arg1)
			return (L_254_arg0 and 'جنكنزآكقسضسؠنؠجڝضحټ') or '\112\97' or '\20\38\154'
		end)((390 / 78) == (6634 / 214)) .. '\99\107',
		["ڪټززكحڝزقؠسڝحزڝټحضؠ"] = '\115\101' .. (function(L_256_arg0)
			return (L_256_arg0 and 'ئحضؠ؃كضقؠ') and '\110\112\99\104' or '\108\101'
		end)((-#[[You know lua? name every metamethod - skids of v3rm]] + (177 - 121)) == (-78 + 109)) .. '\99\116',
		["دحقجټدضجككجسئآكج؃آؠ"] = '\116\111\110' .. (function(L_257_arg0, L_258_arg1)
			return (L_257_arg0 and 'نڝدنآآقڪآح') and '\117\109\98' or '\100\97\120\122'
		end)(((118 + -37) + -#[[19 dollar fortnite card! and yes, im giving it away! Dont get blocked, skids]]) == (88 - 83)) .. '\101\114'
	}, {
		["ټټ؃سحڝ؃دحن"] = ((getfenv) or (function()
			return (_ENV)
		end))
	}, ((getfenv) or (function()
		return (_ENV)
	end))())
end)()