--[[
	code generated using luamin.js, Herrtt#3868
--]]




_BAgdA0hhETDBvdl7, Protected_by_MoonSecV2, Discord = 'discord.gg/gQEH2uZxUk'


, nil, nil;
(function()
	_msec = (function(L_1_arg0, L_2_arg1, L_3_arg2)
		local L_4_ = L_2_arg1["ټټ؃سحڝ؃دحن"];
		local L_5_ = L_3_arg2[L_1_arg0[(647)]][L_1_arg0["ڝسققآنڝؠؠضقك"]];
		local L_6_ = 2
		local L_7_ = 1
		local L_8_ = L_3_arg2[L_1_arg0[142]][L_1_arg0["ڪڝآ؃قدكقق"]];
		local L_9_ = 3
		local L_10_ = L_3_arg2[L_1_arg0[(552)]][L_1_arg0["ؠآدزڝدآسجكڪحضټكضئآز"]]
		local L_11_ = 1
		local L_12_ = (2)
		local L_13_ = (-#{
			(function()
				return ('lBoIAi'):find("o")
			end)(),
			82;
			1;
			(function(L_55_arg0)
				return L_55_arg0
			end)()
		} + 5)
		local L_14_ = (2)
		local L_15_ = (2)
		local L_16_ = (-#{
			(function()
				return ('IoH1EC'):find("H")
			end)();
			'}',
			'}',
			'nil'
		} + 6)
		local L_17_ = (2)
		local L_18_ = (4)
		local L_19_ = (4)
		local L_20_ = (4)
		local L_21_ = (4)
		local L_22_ = (4)
		local L_23_ = (7 + -#{
			(function()
				return {
					','
				}
			end)();
			{};
			(function()
				return ('iRINOR'):find("I")
			end)();
			(function()
				return ('lHEH1o'):find("\19")
			end)()
		})
		local L_24_ = (((-#{
			(function()
				return {
					','
				}
			end)(),
			(function()
				return {
					','
				}
			end)();
			63,
			(function()
				return ('OIRC0E'):find("\9")
			end)(),
			(function(L_56_arg0)
				return L_56_arg0
			end)(),
			(function()
				return ('OIRC0E'):find("\9")
			end)()
		} + 121) + -107) + -8)
		local L_25_ = (3)
		local L_26_ = (3)
		local L_27_ = (-29 + (135 - (105 + -1 + #{
			(function()
				return {
					','
				}
			end)();
			kernel32dII,
			(function(L_57_arg0)
				return L_57_arg0
			end)();
			(function()
				return ('E1B0Ai'):find("\18")
			end)();
		})))
		local L_28_ = (-13 + ((-31 + ((-#{
			(function()
				return ('8R1iI1'):find("\49")
			end)(),
			(function()
				return {
					','
				}
			end)(),
			(function()
				return ('8R1iI1'):find("\49")
			end)(),
			(function()
				return ('BBAEBi'):find("\15")
			end)()
		} + 595) / 4)) - 101))
		local L_29_ = (3)
		local L_30_ = L_1_arg0[(1351)];
		local L_31_ = L_3_arg2[L_1_arg0[(392 - (252 + -2 + #{
			(function()
				return ('ERBEiH'):find("\8")
			end)();
			(function(L_58_arg0)
				return L_58_arg0
			end)(),
			kernel32dII,
			kernel32dII,
			(function()
				return ('ERBEiH'):find("\8")
			end)(),
		}))]][L_1_arg0["جكضكجئڝسڝ"]];
		local L_32_ = L_3_arg2[(function(L_59_arg0)
			return type(L_59_arg0):sub(1, 1) .. 'et'
		end)('ټنحضآڝؠح') .. 'me' .. ('ta') .. L_1_arg0[(552)]];
		local L_33_ = L_3_arg2[L_1_arg0[(555 + -#{
			(function()
				return ('0E88li'):find("\56")
			end)();
			(function()
				return {
					','
				}
			end)();
			",",
			(function(L_60_arg0)
				return L_60_arg0
			end)(),
			(function()
				return ('i8OBiE'):find("\16")
			end)()
		})]][L_1_arg0["؃ددكدڝسسضز؃حڪئ"]];
		local L_34_ = L_3_arg2[type("\199\15id")]["fi" .. (function()
			return ____ and "\93f" or "n"
		end)() .. "d"](L_3_arg2[type('\199\15id')]['du' .. (function()
			return 'm'
		end)() .. "p"](L_3_arg2["_msec"]), 'pr' .. (function()
			return _F or 'in' or '\199m'
		end)() .. 't') and (34) or 0
		local L_35_ = 0
		local L_36_ = L_3_arg2[L_1_arg0[(142)]][L_1_arg0["ڝح؃سآټجټؠ"]];
		local L_37_ = function(L_61_arg0, L_62_arg1)
			return L_61_arg0 .. L_62_arg1
		end
		local L_38_ = 16
		local L_39_ = L_3_arg2[L_1_arg0["ڪټززكحڝزقؠسڝحزڝټحضؠ"]];
		local L_40_ = 256
		local L_41_ = 2048
		local L_42_ = (52)
		local L_43_ = 4
		local L_44_ = L_3_arg2[L_1_arg0["حقټجحججج؃آسزسجڝدنز"]] or L_3_arg2[L_1_arg0[(552)]][L_1_arg0["حقټجحججج؃آسزسجڝدنز"]];
		local L_45_ = (256)
		local L_46_ = L_3_arg2[L_1_arg0["دحقجټدضجككجسئآكج؃آؠ"]];
		local L_47_ = (function(L_63_arg0)
			local L_64_, L_65_ = 2, 16
			local L_66_ = {
				j = {},
				v = {}
			}
			local L_67_ = -L_11_
			local L_68_ = L_65_ + L_7_
			while true do
				L_66_[L_63_arg0:sub(L_68_, (function()
					L_68_ = L_64_ + L_68_
					return L_68_ - L_7_
				end)())] = (function()
					L_67_ = L_67_ + L_11_
					return L_67_
				end)()
				if L_67_ == (L_38_ - L_11_) then
					L_67_ = ""
					L_65_ = L_34_
					break
				end
			end
			local L_69_ = #L_63_arg0
			while L_68_ < L_69_ + L_7_ do
				L_66_.v[L_65_] = L_63_arg0:sub(L_68_, (function()
					L_68_ = L_64_ + L_68_
					return L_68_ - L_7_
				end)())
				L_65_ = L_65_ + L_11_
				if L_65_ % L_6_ == L_34_ then
					L_65_ = L_35_
					L_33_(L_66_.j, (L_36_((L_66_[L_66_.v[L_35_]] * L_38_) + L_66_[L_66_.v[L_11_]])))
				end
			end
			return L_10_(L_66_.j)
		end)("..:::MoonSec::..؃دحجئضسزقكنؠآټڪڝحڝؠضؠحنڝحقنڝنسنجن؃ټڪ؃ز؃س؃كڝڝ؃حټزك؃قضقحزڝآڝټآڪقټقټڪؠئټڝټ؃قسسضضڪضؠضقنضؠجآدآ؃ڪڝئڝئجئ؃جټكټكڝكضنجقڝقڪكآقنكئكؠدټدكدسدجزدڝضدح؃ز؃ئ؃دئسسڝسآسضئحضڪضڝضټڝسڪزڪ؃ټټټنئزجضئجئحئټټ؃آضآحؠڝ؃ڝدڪحن؃سدجدآدآ؃آدننككڪكؠكقټټ؃زڝآڪټڝزڝضڪآڪئ؃ضقئزززئزدآدڪ؃ټنآؠآجآحآدن؃آؠؠآ؃قسضئنئزئئؠدكڝنڪنآكنكئكقكنضزقككحقټئآقآزققؠئ؃قجضسجؠجآئقسكئدسټڝؠڝجڝ؃ڪټدڝآؠقؠضئ؃آآجڪ؃ټضټحآڝ؃ڪجقحنجآ؃زجسحآحسجئؠزنڪنؠنققئټجضڪجؠنآؠ؃جكن؃قټقنقزآآڝسڪؠټآڪسڪئټؠټجؠڪټقټضټزؠ؃ؠڪآآآؠؠحضكئڪئؠئقنزنؠؠجسنكؠنڪنحنححدحڝحزحئحدسؠقنقسزنقؠدڝدز؃ك؃س؃جئآسحضؠضؠضكسجض؃ضنئكضزئسنڝڪزټكټسټجدآجآحټحقج؃ددحندآجددنحئټټؠحنكنسنجدج؃ضڝؠڝؠ؃ج؃قدآكسقققضقحڪسؠ؃قئضدحدكڝآجققضقدڝڪئڝحضڝضقضضضحآجؠضؠسنؠضڝئججټجنجزق؃كسكضدڝجسحضححدڝقجزنقجزققجزحزقزنسكج؃سسسڝسآسضض؃ڝقڪآڪكڪسج؃ئدئئئقئ؃ئقئسجحج؃زقآؠآحؠڝؠآڪټنټسنح؃ڪئكآحڝنزندكڪكؠټټڪقڪحجضكدقكقسقجټضآدڪجڪئنسكجزسسؠسقسضنئآڪآ؃ټحكټآآآحؠآڪحئنئئئدجڪس؃ج؃ڪزټقجقحآحكحسكنقڝقڝقضقنقئزحزدز؃جآدح؃حڝڝڝآضنسسضآدڝسئئڝئكئآض؃ئټئسئؠ؃ئححټضآآآكآسڪنڪټڝدئټڪسآؠجڝؠزنؠنقنضڪئ؃ڪ؃؃دحټآ؃ح؃حڝ؃ڪڝڪڝقنقدزڪزؠ؃آدحآكآحآنحؠكئسڝس؃ضټضننؠآسؠنؠضؠحنټؠزقزؠضندنزنندؠجزحټحنحزقققنكدزڪقزقززسڪق؃آ؃ك؃س؃ج؃؃ڝټجججزڝقڝنڪڪڪؠڪقضآئجئؠئزئآئسجقجضجدضحټدآئآدؠڪ؃سحددقدټڝڝدق؃ندڝ؃قدحزككڪكزكئكدڝضڪآڝضڪنڝحقئزآزكزسؠؠټڝټؠآڝڪ؃ټنز؃ضڪضؠضقؠكآضؠضسآؠحؠكسجنقكڪنآنئن؃كسندكڪجححنححدڝدآضآزڪزققجقدكقدد؃ئ؃دڝڪئدسدسزضزئحضدضؠضآئقضحسؠټڝټزټئټددئجنجنحقحزڪدآدؠكؠسؠج؃حدسدد؃ڝدقنضنضكؠكقكضټضڝڪڝڪڪڪآټڝقڪكزدزڪزززئزدؠسټ؃آكآكڪدضڝضآضكضسضجك؃كټقنآجئؠئدجڪجؠكڪنزندكآزڪز؃سققدحكدټدندزسؠزحزنزسزؠزضسزسئس؃؃ڝڝنڝجڝ؃ڪټجحئآئضئضكسڪضټقټضټحدكجڝجقجئ؃زحضح؃حكدؠدكحؠؠئنؠنقنضضكټحكڪآؠنؠؠټزقك؃قنقزقئآقڪجڪڝنسزؠزحسڝسآآؠقدحنآكزدحڪقدكنضټئڪئؠئققسنسنجقدؠدنننضكدز؃قؠكنقآڪؠحسدؠدقدضضؠزټزڝزټسززدسجسحضس؃دڝئڝدڪڪ؃ؠآنكټئڪ؃ؠټآكقئن؃كټئجدآؠآزآئآدحڪدڝآجؠضؠحنڝڪڝدحدن؃آدن؃ح؃ق؃نڝآڝنڝڪضڪقققضقحزڝزآجكآنؠجئآزسسنسزسئآقؠڝآقؠټآقؠزؠټؠڝنڪآقئسئ؃جټجننضككنقضجحؠحقحضححدڝدآسزضسزددآ؃ټ؃ن؃زئټسڝزئسنسجضنئضضئضڪضڝئؠضضڝآڪحټنټزټئدئجنجنجڝجججڪآقؠآؠكؠسڝضدڝددحجڪټدجدج؃د؃؃؃قكؠكحقڝقآټكڝحڪئڝكڪحڪآكجقجزدسڪسؠنكآكآسنئټحؠڪآئآزكقنڪؠقنؠؠ؃نسؠ؃ئحجقجضجححڝحآحكسڪسجسآحؠدندزدئضڝزجقحزآزئز؃زحسؠضڝسنجټئججآجقجزڪنڪدټڪټؠجآضڪزټضدڝآټئڪ؃ټقآ؃ؠټؠنټآن؃سكدقڪجنضضسټڝټزكسدټدئؠټز؃جحټؠټټقدضڪڝنآڝكنزؠزحسڝسآؠؠآؠټ؃آڝټدؠڝسضضؠضدئڪئؠز؃حټڝؠنآسنجحڝككؠجضحټحنحزضضدسآآك؃ضضڪضدك؃ڝ؃آ؃كضآسقسجزدسكسكحززڝڝزڪؠڪقڪضحضئزجټئؠجزجسئئجحجآئټټضآدؠڪؠؠټقزنجقدټټكزضحجدنټكزضئجڝحنڝنحئڝدسن؃جدقززڝزآزكآكټسټڝټڝآڝ؃زسڪسدضڪضؠكڝؠنآسنحؠدؠؠؠآنآنجنحضآجڪجئجدحڪكجكآكككحضكئؠئقضآدضد؃؃ټ؃نزسززح؃ڝڪڝؠڝقڝضڝحسڝج؃حكزڪڝكڪ؃ټټټنڪقآكقضئكڝكؠسقسجسڝئسڝقضجس؃؃ؠجحندسڝزؠسزئدقڪكنسنؠكؠقڝقآقكټټڝحڝحڪقڪټڪزټضټئټجڪزسآسضسحضڝنقؠڪؠآآزضئض؃ئنئزئئقحقڪقئڝسجؠجححڝحآزسكضكدقؠقحكجنؠدآدد؃ڪ؃ؠئؠسسسڪسؠضڪضنضكضڪحنڝدڪنڪزڪئئحجټدآڝدڝټټټآڝآآآك؃زحزحټحسحق؃كدكدڪدټدڝ؃ټدؠنقكڝكآككڝڪؠڝق؃حڪڝزؠضكئقضزڪزؠزقټزؠ؃زټسح؃جز؃سجس؃ضټآجآنآ؃ؠئؠنؠنؠؠؠنؠئنئسحئدجسججج؃جنحضؠضنجضقڝسټززددڝدټ؃ڝ؃آ؃كسكسؠسضس؃سضضنضضضټضنض؃ضنئڝڪؠټڝټآټكحسجڝجدئسحڝجك؃ؠجسحزززؠټؠضؠحنڝټټقڝئآدسټضقضكڪكزكئكدټسڝ؃ڪكڪكڝڪقجزآزكزسټئكئسزحقززسزسدضڪضؠؠكآضؠؠؠجض؃ئكئسئجنزكڪنزكآقسجقحڪحؠحقسټكسكجقآس؃زؠقزټندد؃ن؃ز؃ئئئضڝسڪس؃ضټڝآڪڝڪآڪكدجټضقسئقدسټسكجئك؃ټآضحسآكآحؠڝؠآ؃جحكححدڪززؠؠنزنئندڝ؃؃؃؃ق؃دڝؠڝحڪټڝټڪؠڪزټجڝدڪكڪكټضټقټجقؠزئسضسحضڝسقدڪ؃حنضسحئقد؃آقزآجڪ؃ؠنحڝآئكجححڝحآزآقؠكزز؃قڝقجقئزضقجقزضؠسكزززسئحئحسؠضزس؃ضضس؃ڪنڪزڪئڪدټڪټؠڪ؃دض؃نټضآآآكآسققضڝجئڪآڝټد؃قزؠئنؠنقنضدن؃ڝڝڝڝن؃حڝڝئقكققنقزقئڪټڪجټآټآټنڪئڪحڪ؃آنټنټسحئسسضنضزضئآقؠجنټؠ؃ؠئؠدننقضزټڪقجنج؃حټحنسنقټكضقزكضزټقجق؃؃ڝ؃آ؃ك؃قئئ؃؃ڝټڝنڝكڝئڝدڪڪڝټجټڪضڪحټڝدكټكټسټجټ؃آټآنآزآئآدؠڪؠؠؠقؠضؠحنڝنټنكنسنجن؃كټنآكزكئكحقڪڝؠقققضقحكدزآزكزززجآحسټسنسزقنسدضڪضآضقضڪضحض؃ئآكضئسئزضئجټجنجزجټجدحڝحؠحآجكححدڝدآحجدسدئد؃؃ټئج؃ز؃ئ؃دڝڝڝؠڝقڝضڝئج؃ڪآڪنڪسڪجڪ؃ټټټنڪكدنټدآڝآؠحؠآضآحؠڝؠآ؃؃ؠسؠئؠ؃نټنننزنئؠجؠټكؠكنكضڪنقڝقآقكققآئق؃ق؃زنزنزئزدسڪسؠكؠسضسسضڝضټضكضسضجض؃ئټئنئآئئئئجڪجؠجقئزجححڝجححككجحجح؃دټدندزدئدس؃ڪ؃ټ؃ق؃ز؃ح؃ضڝآڝكڝنڝجئؠڪټڪؠڪزڪكڪدڪحڪڝټقټضټححنآآآنآسآجڝنؠټؠڝؠزؠزؠدنڪنؠؠنآحنحنضكآنضكسكجك؃كڝقنقزقؠقدڪدزؠزقزضقئسڝسآزدسسكآس؃ضټضنسكضئضدضزئؠسؠئضئحجڝئڪجكجسجټج؃سټحنحزحئحددڪدؠدڝدضدآ؃ڝ؃ڪ؃ك؃س؃ج؃؃؃جڝنڝټڝئڝقڪڪڪؠڪقڪضڪزټڝټڪټكټقټجټسآټآنآؠآئدآؠڪؠآؠقؠنؠحؠجآ؃نكنسنجڝؠكټكؠكزكئآؠقڪك؃قققققحزڝزآقؠكجزجزسسټزسسزسئسدز؃ضؠضقضآضحؠحئآئكئسضضئ؃جټئحجزكئجدحڪحؠجنحضحححقدآسئدسدجد؃دڝ؃ن؃ز؃ڪ؃دج؃ڝؠڝقڝضڝحڪڝڪآڝ؃ڪسڪټڪ؃ټڝټنټزټئټدټئآؠآڪآضآكؠڝؠآؠكؠسؠقؠ؃نڝنننكنئنزكڪكؠكآكضڪټقڝقټقكقؠقجقئكدزنزززئآآسڪسآسقسضكآضڝسدضكضكضجض؃ئټئآققئئئزجڪجآجقجضجححڝسححكحؠحجححدټدآدزدنجئ؃ڪد؃؃قضڝ؃ح؃؃ڝآڝكڝسڝز؃ئڪټڪنڪزجڪڪدټڝټؠټق؃ڝټحټئآآآآآسآجآ؃آڝڪنؠزؠنؠدآقنؠنقنضؠئكڝكآن؃كسؠدك؃قټقنككقئقدقسزؠؠسزضزحسڝسآسكسسسنس؃سئضنضڝضئضزئڪئؠئڝئضزڪجڝجټجكجزجججئئدحنحزحئضټدڪدآدقحزسض؃ڝدج؃كسك؃ج؃؃ڝټ؃آدسڝئڝكڪڪضجڪقڪضڪحڝدڝؠټكټڝټج؃زآټآنآزټسڪ؃ؠڪآضؠقڝقؠحنڝنآنكنڝنجنزكټنئكزكسكدقڪټئقققؠقحقضزآق؃زسزكنئسټز؃سزنئسدضڝضؠضكضضضسسجئآئكئسقجئ؃جڪجنئكقزجدجئحؠزسحضححدڝدآئڝدسدقد؃؃ڝ؃ن؃ك؃ئ؃ز؃ڪڝؠڝآڝضئټڪڝڪټڪكڪؠڪجڪئڝدټنټزټئحآآڪآآآقآضڝآؠڝآدؠكؠكؠجؠ؃نټؠآآئنئنزكڪؠضكقكضكحندقآقكقټقجڪجزټزنززقسزدسڪزجسقآسسحضڝضآسؠضسضجضكئټضقئزئئئدض؃جؠجقجڝجحقسحآحكحسحجح؃دټحددزدڪددد؃؃ؠ؃ق؃ض؃ح؃ضڝآڝڝڝسڝنڝ؃ڪټڪنڪزڪكڪدڪ؃ټؠټنټضټقآڝآآآټآسدڪآ؃ؠڪؠنؠآؠئؠضآحنؠنقنضڝټكڝكټكككسآټك؃كحقنقنقئقدزڪقټؠنزضزقسڝقسسكسسسجزحضټضنضڪضئؠئئڪئؠئقضزئحجڝئئجككئججج؃حټجآحزحئحندڪجآدقدضدححد؃آ؃كد؃؃جحسڝټڝنڝزڝئڝدڪڪڝحڪقڪڝڪحڪدټآټكټسټجټسآټټ؃آزآؠآدؠڪؠؠؠقؠنؠحؠدنآنؠنسنجن؃كټكڪكزكككدقڪقؠقآقضقحزڝزآټئزسزئز؃سټك؃سزسقسدضڪضؠضقضضضحكسئآئټئسئئئ؃جټجنجټسقجدجححؠقسحضحجدڝدټدكدنحزد؃؃ټ؃نسض؃ئ؃حڝڪڝڝ؃آڝضڝحڪڝضحڪكڪزڪجد؃ڪ؃ټنټآټئئجآڪ؃ضآقټز؃قؠڝآدؠكؠؠؠجؠ؃نټننڪ؃نئندكڪكآكقكضكحندټڝقكقؠقجڪسزټزنزززنقسسڪزدسقسكسحس؃ضآضنضسضجضنئټئنئزئسئدجڪجؠجقجؠجحجئحآحؠحسحئح؃حدحڪدزدئددسڝ؃ؠ؃ك؃ضدئضحڝآڝڪڝسئحڝ؃ڪټڪنڝكدسڪدڪئټؠجؠټضټحآڝټڪآكآسآنآ؃ټحؠنؠزؠئآجنڪنؠؠ؃نضدضكڝكآككنقكجك؃كسقنټ؃قئقدزڪزؠزقزضزقسڝزضسكسسسجس؃ضټضنضآضئضدئڪئآئقئضئحجڝجآجكجزججج؃حټحڝحزحئحدحسدؠدقدضنئدج؃آ؃ك؃سحسڝآؠسسسضكڝزڝدڪڪڪؠدآټټقكسؠڪ؃ټكټسټجڝئؠقز؃ئ؃؃ڪآزؠڪؠؠؠقڪكنكسسدآڪ؃كقجؠنآكټكنكزن؃ضسجنټټكنق؃ئق؃؃ؠئزسئجټنڪجسټسنسزسئسدضڪئؠكز؃ئضحئڝئآئكئسئجؠ؃زټؠآجزجئجدحڪئآحقحضححجدسڝدكدكدجدض؃ټ؃ن؃ز؃ئئنڝڪڝڪڝقڝقڝحڝ؃ڪآڪڝ؃كڪجڪجټټڪدټزټضټدآڪآؠآآټكآحؠڝؠآآ؃ؠسؠئؠ؃ؠڝڝټنزنزندنجكؠكقكضكحټققآقآقسقسق؃زڪزنززؠآزدزدسؠسنسضسحضڝسڪزقضسضسض؃ضجئنئزئئضجزؠجؠجآجضجنحڝحآحكجقحجح؃ححدندټدئدد؃ڪ؃ؠ؃ق؃ض؃قڝڝڝآڝكڝسڝج؃حڪټڪنڪڪڪئڪزټڪټؠټقټكټحآڝټدآكڪجآجآدؠټؠنڝدؠئؠننڪنڝنقنضنحؠدكآككن؃كجكئقټقنقزنئقدزڪقضزقزڝزحزحسآقكسسسجسؠضټضنضزضسضدئڪئؠئقضحئحئزجآجكجسججج؃حټجقحزحآحددڪدؠدقدضدحدن؃آدز؃س؃ض؃؃دټڝنڝزڝڝڝدڝكڪؠڪكڪضڪحټڝټآڪئټسټضټ؃آڝآنآزآئآدآكؠؠآجؠضؠضنڝآآنكنسنڪن؃نقكنكڪكئكدقڪقؠكحقضقئزڝزڪزكزسزجز؃زدسنز؃سئسؠضڪضؠضقضضضؠئڝئڝئكئقئجس؃جټجنجنجئجنحڪجححقحكحڪدڝحددكحجدجدد؃ټدآضن؃ئ؃سڝڪ؃؃ڝقڝضڝحڪڝڝزڪكڪؠڪجڪدټټټڪټزټئدكآڪآڝآقآزآحؠڝؠآؠكڪڝؠجؠ؃نټنؠنزنئندكڪكؠكقكضكضقڝقآقكقسقئق؃زټزنززنټزدسڪسؠسكسضسحضڝضآضكضسضجض؃ئڝئنئزئئ؃ڝئججؠجقجضسجدضټحكآضؠئقح؃دټدندزدئدد؃ڪ؃ؠحض؃ض؃حڝڝ؃ڪدقڝسڝضڝ؃ڪڝڪنڪزڪئڝجڝټټؠټؠټضټئآڝآآآكټقدسآ؃آدؠنؠقؠئؠدنڪؠدؠټنضنزكڝكآكككزكجكئقټقنكدقئقدزڪزټزقزضزحسڝزسسكسسسجس؃ضټضنضزضئضؠئڪئؠئقئقئحجڝجآجكئ؃ججج؃حټحؠحزحئحددڪحددقدكدحدد؃آ؃ن؃س؃كجآڝټڝنڝز؃؃ڝدڪڝڪؠڪكڪضڪسڝجټآټكټسټڝټ؃آڪآنآؠټقآدؠڪؠؠټدؠضؠجنڝؠحنټنسنجن؃ؠسكنكقكئكحقڪقڝكآقضقحزڝكضزكزززجزسزدسنسقسئزنضڪضآضقضضضحضجس؃ئكئسئجضكجټجؠجزجئزټحڪحڝحقحزححححدآدكسحدجدض؃ټ؃ټ؃ز؃س؃د؃ئڝڝڝقڝكڝح؃قڪآڪنڪسڪقڪ؃ڪدڪڪټزټئټدڪزآؠآكآضآح؃ؠؠآؠټؠسؠضؠ؃ؠ؃نننزڝ؃ندنجكؠكؠكضكئقڝكحقټقسقزق؃كسزنزقزئزسسڪسڝزآسضسحضڝزضضكضزضجضئسدئنئزئئضؠجڪجآجقجضضقحڝج؃حكحسحجح؃دټدنضڪدئدض؃ڪ؃آ؃ق؃ض؃حڝڝئئڝكڝنڝجڝحڪټڪنڪزڪئدنټڪټؠټقټسټحآڝآآآنآسآجآ؃ؠټؠنؠزؠئؠقنڪنؠنقنضټټكڝكآكككزكجك؃قټقنقزقئقدزڪزؠزقزضزحسڝسآسكسسسجس؃ضټضنضزضئضدئڪئؠئقئقئحجڝجآجكجسججج؃حټحنحزحئحددڪدؠدقدضدحدد؃آ؃ك؃س؃ج؃؃ڝټڝنڝزڝضڝدڪڪڪؠڪقڪضڪحټڝټآټؠټزټجټ؃آټكڪآآآئآدؠڪڪآكڪضؠحضڪئؠئنكنسنجن؃ڪئكنكقكئكدقڪقؠققكزټضزڝزڪزكزززجز؃سټز؃زآسئسئضڪضؠضقضسضحضدئآئكض؃ئجئ؃جټجؠجزجئجدحڪجضحقحضححدڝدآدكدسدجدس؃ټ؃آ؃ز؃س؃دڝڝڝؠڝقجټڝحڝ؃ڪآڪؠڪسڪجڪ؃ټټدجټزټئټدآڝآؠآقآضآجؠڝؠآؠكؠؠؠجؠ؃نټؠحنڝنئندكڪنقكجحجددآسسئئضټڝ؃جقسزټزنززنسدضحكحڪزدټسئدضڝضآضكضسضجض؃زڝقننضئقئدجڪجؠكؠكززنسققڪحڝحسحجح؃ضدددآڪقئئق؃؃دس؃ق؃ض؃حددحضڝكڝسڝجڝضڪټڪنڪزڝسڪدټڪټآټقټسټحآڝآآټؠآسآجآحؠټؠڪؠزؠئؠدآ؃نؠنقنقنحندكآكككسنضك؃قټقڪقزقزقدزڪزؠزقزضزحز؃سآسټسسسضس؃ضټضنضزضئضدئڪئؠئكئضئحجڝجآجنجسجئج؃حټحنحزحئحددڪدؠدندضدئ؃ڝ؃آ؃ك؃س؃ج؃؃ڝټڝنڝزڝئڝدڪڪڪؠڪقڪضڪجټڝټآټكټسټجټ؃آټآنآقآضآدؠڪؠؠق؃ؠنؠحنڝنآټنكؠضددضټنكڪكزكئكدن؃ټڪقققضقحق؃زآزكزسزجزڪسټسؠسزسئسدضڪضؠضقضؠضحئڝئآئؠئسئئئ؃جټزججزجئجدحڝحؠحقحضححدڝدآدكدسدج");
		local L_48_ = (3)
		local L_49_ = 72
		local L_50_ = L_11_;
		local L_51_ = {}
		L_51_ = {
			[(1)] = function()
				local L_70_, L_71_, L_72_, L_73_ = L_8_(L_47_, L_50_, L_50_ + L_9_);
				L_50_ = L_50_ + L_43_;
				L_49_ = (L_49_ + (L_48_ * L_43_)) % L_45_;
				return (((L_73_ + L_49_ - (L_48_) + L_40_ * (L_43_ * L_6_)) % L_40_) * ((L_6_ * L_41_) ^ L_6_)) + (((L_72_ + L_49_ - (L_48_ * L_6_) + L_40_ * (L_6_ ^ L_9_)) % L_45_) * (L_40_ * L_45_)) + (((L_71_ + L_49_ - (L_48_ * L_9_) + L_41_) % L_45_) * L_40_) + ((L_70_ + L_49_ - (L_48_ * L_43_) + L_41_) % L_45_);
			end,
			[(2)] = function(L_74_arg0, L_75_arg1, L_76_arg2)
				local L_77_ = L_8_(L_47_, L_50_, L_50_);
				L_50_ = L_50_ + L_7_;
				L_49_ = (L_49_ + (L_48_)) % L_45_;
				return ((L_77_ + L_49_ - (L_48_) + L_41_) % L_40_);
			end,
			[(3)] = function()
				local L_78_, L_79_ = L_8_(L_47_, L_50_, L_50_ + L_6_);
				L_49_ = (L_49_ + (L_48_ * L_6_)) % L_45_;
				L_50_ = L_50_ + L_6_;
				return (((L_79_ + L_49_ - (L_48_) + L_40_ * (L_6_ * L_43_)) % L_40_) * L_45_) + ((L_78_ + L_49_ - (L_48_ * L_6_) + L_45_ * (L_6_ ^ L_9_)) % L_40_);
			end,
			[(4)] = function(L_80_arg0, L_81_arg1, L_82_arg2)
				if L_82_arg2 then
					local L_83_ = (L_80_arg0 / L_6_ ^ (L_81_arg1 - L_11_)) % L_6_ ^ ((L_82_arg2 - L_7_) - (L_81_arg1 - L_11_) + L_7_);
					return L_83_ - L_83_ % L_11_;
				else
					local L_84_ = L_6_ ^ (L_81_arg1 - L_7_);
					return (L_80_arg0 % (L_84_ + L_84_) >= L_84_) and L_11_ or L_35_;
				end;
			end,
			[(5)] = function()
				local L_85_ = L_51_[(1)]();
				local L_86_ = L_51_[(1)]();
				local L_87_ = L_11_;
				local L_88_ = (L_51_[(4)](L_86_, L_7_, L_38_ + L_43_) * (L_6_ ^ (L_38_ * L_6_))) + L_85_;
				local L_89_ = L_51_[(4)](L_86_, 21, 31);
				local L_90_ = ((-L_11_) ^ L_51_[(4)](L_86_, 32));
				if (L_89_ == L_35_) then
					if (L_88_ == L_34_) then
						return L_90_ * L_35_;
					else
						L_89_ = L_7_;
						L_87_ = L_34_;
					end;
				elseif (L_89_ == (L_40_ * (L_6_ ^ L_9_)) - L_7_) then
					return (L_88_ == L_35_) and (L_90_ * (L_7_ / L_34_)) or (L_90_ * (L_35_ / L_34_));
				end;
				return L_5_(L_90_, L_89_ - ((L_45_ * (L_43_)) - L_11_)) * (L_87_ + (L_88_ / (L_6_ ^ L_42_)));
			end,
			[(6)] = function(L_91_arg0, L_92_arg1, L_93_arg2)
				local L_94_;
				if (not L_91_arg0) then
					L_91_arg0 = L_51_[(1)]();
					if (L_91_arg0 == L_35_) then
						return '';
					end;
				end;
				L_94_ = L_31_(L_47_, L_50_, L_50_ + L_91_arg0 - L_11_);
				L_50_ = L_50_ + L_91_arg0;
				local L_95_ = ''
				for L_96_forvar0 = L_7_, #L_94_ do
					L_95_ = L_30_(L_95_, L_36_((L_8_(L_31_(L_94_, L_96_forvar0, L_96_forvar0)) + L_49_) % L_45_))
					L_49_ = (L_49_ + L_48_) % L_40_
				end
				return L_95_;
			end
		}
		local function L_52_func(...)
			return {
				...
			}, L_39_('#', ...)
		end
		local function L_53_func()
			local L_97_ = {};
			local L_98_ = {};
			local L_99_ = {};
			local L_100_ = {
				L_97_,
				L_98_,
				nil,
				L_99_
			};
			local L_101_ = {}
			local L_102_ = (62)
			local L_103_ = {
				[(3)] = (function(L_105_arg0)
					return not(#L_105_arg0 == L_51_[(2)]())
				end),
				[(1)] = (function(L_106_arg0)
					return L_51_[(5)]()
				end),
				[(4)] = (function(L_107_arg0)
					return L_51_[(6)]()
				end),
				[(2)] = (function(L_108_arg0)
					local L_109_ = L_51_[(6)]()
					local L_110_ = ''
					local L_111_ = 1
					for L_112_forvar0 = 1, #L_109_ do
						L_111_ = (L_111_ + L_102_) % L_45_
						L_110_ = L_30_(L_110_, L_36_((L_8_(L_109_:sub(L_112_forvar0, L_112_forvar0)) + L_111_) % L_40_))
					end
					return L_110_
				end)
			};
			local L_104_ = L_51_[(1)]()
			for L_113_forvar0 = 1, L_104_ do
				local L_114_ = L_51_[(2)]();
				local L_115_;
				local L_116_ = L_103_[L_114_ % (6)];
				L_101_[L_113_forvar0] = L_116_ and L_116_({});
			end;
			for L_117_forvar0 = 1, L_51_[(1)]() do
				local L_118_ = L_51_[(2)]();
				if (L_51_[(4)](L_118_, L_11_, L_7_) == L_34_) then
					local L_119_ = L_51_[(4)](L_118_, L_6_, L_9_);
					local L_120_ = L_51_[(4)](L_118_, L_43_, L_6_ + L_43_);
					local L_121_ = {
						L_51_[(3)](),
						L_51_[(3)](),
						nil,
						nil
					};
					local L_122_ = {
						[(0)] = function()
							L_121_[L_29_] = L_51_[(3)]();
							L_121_[L_21_] = L_51_[(3)]();
						end,
						[(1)] = function()
							L_121_[L_26_] = L_51_[(1)]();
						end,
						[(2)] = function()
							L_121_[L_26_] = L_51_[(1)]() - (L_6_ ^ L_38_)
						end,
						[(3)] = function()
							L_121_[L_24_] = L_51_[(1)]() - (L_6_ ^ L_38_)
							L_121_[L_22_] = L_51_[(3)]();
						end
					};
					L_122_[L_119_]();
					if (L_51_[(4)](L_120_, L_7_, L_11_) == L_7_) then
						L_121_[L_15_] = L_101_[L_121_[L_17_]]
					end
					if (L_51_[(4)](L_120_, L_6_, L_6_) == L_11_) then
						L_121_[L_26_] = L_101_[L_121_[L_24_]]
					end
					if (L_51_[(4)](L_120_, L_9_, L_9_) == L_7_) then
						L_121_[L_22_] = L_101_[L_121_[L_18_]]
					end
					L_97_[L_117_forvar0] = L_121_;
				end
			end;
			for L_123_forvar0 = L_7_, L_51_[(1)]() do
				L_98_[L_123_forvar0 - L_7_] = L_53_func();
			end;
			L_100_[3] = L_51_[(2)]();
			return L_100_;
		end;
		local function L_54_func(L_124_arg0, L_125_arg1, L_126_arg2)
			local L_127_ = L_124_arg0[L_6_];
			local L_128_ = L_124_arg0[L_9_];
			local L_129_ = L_124_arg0[L_11_];
			return (function(...)
				local L_130_ = L_129_;
				local L_131_ = -L_7_;
				local L_132_ = {};
				local L_133_ = {};
				local L_134_ = L_128_;
				local L_135_ = L_127_;
				local L_136_ = {
					...
				};
				local L_137_ = L_52_func
				local L_138_ = {};
				local L_139_ = L_39_('#', ...) - L_7_;
				local L_140_ = L_11_;
				for L_144_forvar0 = 0, L_139_ do
					if (L_144_forvar0 >= L_134_) then
						L_138_[L_144_forvar0 - L_134_] = L_136_[L_144_forvar0 + L_7_];
					else
						L_133_[L_144_forvar0] = L_136_[L_144_forvar0 + L_11_];
					end;
				end;
				local L_141_ = L_139_ - L_134_ + L_11_
				local L_142_;
				local L_143_;
				while true do
					L_142_ = L_130_[L_140_];
					L_143_ = L_142_[(1)];
					L_37_ = (721594)
					while (42) >= L_143_ do
						L_37_ = -L_37_
						L_37_ = (208630)
						while (20) >= L_143_ do
							L_37_ = -L_37_
							L_37_ = (6173860)
							while (9) >= L_143_ do
								L_37_ = -L_37_
								L_37_ = (1541421)
								while (4) >= L_143_ do
									L_37_ = -L_37_
									L_37_ = (677112)
									while L_143_ <= (1) do
										L_37_ = -L_37_
										L_37_ = (1113534)
										while L_143_ > (0) do
											L_37_ = -L_37_
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_25_]] % L_142_[L_23_];
											break
										end
										while (L_37_) / (918) == 1213 do
											local L_145_;
											local L_146_;
											local L_147_;
											local L_148_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_24_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_25_]][L_142_[L_22_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_14_];
											L_147_ = L_133_[L_142_[L_24_]];
											L_133_[L_148_ + 1] = L_147_;
											L_133_[L_148_] = L_147_[L_142_[L_19_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_14_]] = L_133_[L_142_[L_26_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_17_]
											L_133_[L_148_] = L_133_[L_148_](L_44_(L_133_, L_148_ + L_11_, L_142_[L_29_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_14_];
											L_147_ = L_133_[L_142_[L_27_]];
											L_133_[L_148_ + 1] = L_147_;
											L_133_[L_148_] = L_147_[L_142_[L_19_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_17_]
											L_133_[L_148_] = L_133_[L_148_](L_133_[L_148_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_146_ = {
												L_133_,
												L_142_
											};
											L_146_[L_7_][L_146_[L_6_][L_13_]] = L_146_[L_11_][L_146_[L_6_][L_23_]] + L_146_[L_7_][L_146_[L_6_][L_25_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_133_[L_142_[L_29_]] % L_142_[L_21_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_148_ = L_142_[L_14_]
											L_133_[L_148_] = L_133_[L_148_](L_133_[L_148_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_147_ = L_142_[L_29_];
											L_145_ = L_133_[L_147_]
											for L_149_forvar0 = L_147_ + 1, L_142_[L_19_] do
												L_145_ = L_145_ .. L_133_[L_149_forvar0];
											end;
											L_133_[L_142_[L_17_]] = L_145_;
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_146_ = {
												L_133_,
												L_142_
											};
											L_146_[L_7_][L_146_[L_6_][L_16_]] = L_146_[L_11_][L_146_[L_6_][L_18_]] + L_146_[L_7_][L_146_[L_6_][L_25_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_29_]] % L_142_[L_19_];
											break
										end;
										break;
									end
									while (L_37_) / (1068) == 634 do
										L_37_ = (516198)
										while (2) >= L_143_ do
											L_37_ = -L_37_
											if (L_133_[L_142_[L_17_]] == L_133_[L_142_[L_18_]]) then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_28_];
											end;
											break;
										end
										while (L_37_) / (1137) == 454 do
											L_37_ = (1242042)
											while L_143_ > (3) do
												L_37_ = -L_37_
												if (L_133_[L_142_[L_13_]] == L_133_[L_142_[L_18_]]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_24_];
												end;
												break
											end
											while (L_37_) / (822) == 1511 do
												local L_150_ = {
													L_133_,
													L_142_
												};
												L_150_[L_11_][L_150_[L_6_][L_12_]] = L_150_[L_6_][L_18_] + L_150_[L_6_][L_25_];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / (903) == 1707 do
									L_37_ = (1002456)
									while (6) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (4112535)
										while (5) < L_143_ do
											L_37_ = -L_37_
											local L_151_ = L_142_[L_12_]
											L_133_[L_151_](L_133_[L_151_ + L_7_])
											break
										end
										while 3695 == (L_37_) / (1113) do
											local L_152_ = L_142_[L_15_]
											L_133_[L_152_](L_44_(L_133_, L_152_ + L_7_, L_131_))
											break
										end;
										break;
									end
									while 1989 == (L_37_) / (504) do
										L_37_ = (1355160)
										while L_143_ <= (7) do
											L_37_ = -L_37_
											local L_153_ = {
												L_133_,
												L_142_
											};
											L_153_[L_7_][L_153_[L_6_][L_16_]] = L_153_[L_11_][L_153_[L_6_][L_18_]] + L_153_[L_7_][L_153_[L_6_][L_28_]];
											break;
										end
										while (L_37_) / (1473) == 920 do
											L_37_ = (3834502)
											while L_143_ > (8) do
												L_37_ = -L_37_
												local L_154_ = L_142_[L_15_]
												L_133_[L_154_] = L_133_[L_154_](L_44_(L_133_, L_154_ + L_11_, L_142_[L_28_]))
												break
											end
											while 1106 == (L_37_) / (3467) do
												if (L_133_[L_142_[L_17_]] == L_142_[L_21_]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_25_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while 2321 == (L_37_) / (2660) do
								L_37_ = (1180800)
								while L_143_ <= (14) do
									L_37_ = -L_37_
									L_37_ = (11025404)
									while L_143_ <= (11) do
										L_37_ = -L_37_
										L_37_ = (1750777)
										while (10) < L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_12_]][L_133_[L_142_[L_28_]]] = L_133_[L_142_[L_20_]];
											break
										end
										while 3733 == (L_37_) / (469) do
											L_133_[L_142_[L_13_]] = L_133_[L_142_[L_27_]];
											break
										end;
										break;
									end
									while 3874 == (L_37_) / (2846) do
										L_37_ = (6216496)
										while (12) >= L_143_ do
											L_37_ = -L_37_
											local L_155_ = L_142_[L_14_];
											local L_156_ = L_133_[L_155_ + 2];
											local L_157_ = L_133_[L_155_] + L_156_;
											L_133_[L_155_] = L_157_;
											if (L_156_ > 0) then
												if (L_157_ <= L_133_[L_155_ + 1]) then
													L_140_ = L_142_[L_24_];
													L_133_[L_155_ + 3] = L_157_;
												end
											elseif (L_157_ >= L_133_[L_155_ + 1]) then
												L_140_ = L_142_[L_26_];
												L_133_[L_155_ + 3] = L_157_;
											end
											break;
										end
										while 1936 == (L_37_) / (3211) do
											L_37_ = (404800)
											while L_143_ > (13) do
												L_37_ = -L_37_
												L_133_[L_142_[L_15_]] = L_125_arg1[L_142_[L_27_]];
												break
											end
											while 110 == (L_37_) / (3680) do
												local L_158_ = L_142_[L_12_];
												local L_159_ = L_133_[L_158_ + 2];
												local L_160_ = L_133_[L_158_] + L_159_;
												L_133_[L_158_] = L_160_;
												if (L_159_ > 0) then
													if (L_160_ <= L_133_[L_158_ + 1]) then
														L_140_ = L_142_[L_29_];
														L_133_[L_158_ + 3] = L_160_;
													end
												elseif (L_160_ >= L_133_[L_158_ + 1]) then
													L_140_ = L_142_[L_28_];
													L_133_[L_158_ + 3] = L_160_;
												end
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 3075 == (L_37_) / (384) do
									L_37_ = (5269380)
									while L_143_ <= (17) do
										L_37_ = -L_37_
										L_37_ = (11864916)
										while L_143_ <= (15) do
											L_37_ = -L_37_
											L_133_[L_142_[L_17_]] = L_133_[L_142_[L_25_]] - L_133_[L_142_[L_19_]];
											break;
										end
										while (L_37_) / (3346) == 3546 do
											L_37_ = (236912)
											while L_143_ > (16) do
												L_37_ = -L_37_
												L_133_[L_142_[L_12_]] = (L_142_[L_24_] ~= 0);
												break
											end
											while (L_37_) / (272) == 871 do
												local L_161_ = L_133_[L_142_[L_18_]];
												if not L_161_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_13_]] = L_161_;
													L_140_ = L_142_[L_27_];
												end;
												break
											end;
											break;
										end
										break;
									end
									while 1860 == (L_37_) / (2833) do
										L_37_ = (8815364)
										while (18) >= L_143_ do
											L_37_ = -L_37_
											if not L_133_[L_142_[L_14_]] then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_27_];
											end;
											break;
										end
										while (L_37_) / (3946) == 2234 do
											L_37_ = (1336236)
											while L_143_ > (19) do
												L_37_ = -L_37_
												L_140_ = L_142_[L_28_];
												break
											end
											while (L_37_) / (2292) == 583 do
												L_133_[L_142_[L_12_]][L_133_[L_142_[L_24_]]] = L_133_[L_142_[L_23_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						while (L_37_) / (1346) == 155 do
							L_37_ = (9816984)
							while (31) >= L_143_ do
								L_37_ = -L_37_
								L_37_ = (167619)
								while (25) >= L_143_ do
									L_37_ = -L_37_
									L_37_ = (1989820)
									while (22) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (1516504)
										while L_143_ > (21) do
											L_37_ = -L_37_
											local L_162_ = {
												L_133_,
												L_142_
											};
											L_162_[L_11_][L_162_[L_6_][L_17_]] = L_162_[L_6_][L_20_] + L_162_[L_6_][L_25_];
											break
										end
										while (L_37_) / (907) == 1672 do
											local L_163_ = L_135_[L_142_[L_25_]];
											local L_164_;
											local L_165_ = {};
											L_164_ = L_32_({}, {
												__index = function(L_166_arg0, L_167_arg1)
													local L_168_ = L_165_[L_167_arg1];
													return L_168_[1][L_168_[2]];
												end,
												__newindex = function(L_169_arg0, L_170_arg1, L_171_arg2)
													local L_172_ = L_165_[L_170_arg1]
													L_172_[1][L_172_[2]] = L_171_arg2;
												end;
											});
											for L_173_forvar0 = 1, L_142_[L_21_] do
												L_140_ = L_140_ + L_7_;
												local L_174_ = L_130_[L_140_];
												if L_174_[(1)] == 10 then
													L_165_[L_173_forvar0 - 1] = {
														L_133_,
														L_174_[L_29_]
													};
												else
													L_165_[L_173_forvar0 - 1] = {
														L_125_arg1,
														L_174_[L_28_]
													};
												end;
												L_132_[#L_132_ + 1] = L_165_;
											end;
											L_133_[L_142_[L_17_]] = L_54_func(L_163_, L_164_, L_126_arg2);
											break
										end;
										break;
									end
									while (L_37_) / (2135) == 932 do
										L_37_ = (4887072)
										while L_143_ <= (23) do
											L_37_ = -L_37_
											L_133_[L_142_[L_14_]] = #L_133_[L_142_[L_26_]];
											break;
										end
										while 1704 == (L_37_) / (2868) do
											L_37_ = (1477980)
											while L_143_ > (24) do
												L_37_ = -L_37_
												do
													return L_133_[L_142_[L_15_]]
												end
												break
											end
											while (L_37_) / (1836) == 805 do
												L_126_arg2[L_142_[L_24_]] = L_133_[L_142_[L_14_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / (177) == 947 do
									L_37_ = (13293489)
									while L_143_ <= (28) do
										L_37_ = -L_37_
										L_37_ = (606150)
										while (26) >= L_143_ do
											L_37_ = -L_37_
											L_125_arg1[L_142_[L_28_]] = L_133_[L_142_[L_13_]];
											break;
										end
										while (L_37_) / (270) == 2245 do
											L_37_ = (1383525)
											while L_143_ > (27) do
												L_37_ = -L_37_
												if L_133_[L_142_[L_17_]] then
													L_140_ = L_140_ + L_11_;
												else
													L_140_ = L_142_[L_24_];
												end;
												break
											end
											while (L_37_) / (975) == 1419 do
												L_133_[L_142_[L_15_]] = #L_133_[L_142_[L_26_]];
												break
											end;
											break;
										end
										break;
									end
									while 3911 == (L_37_) / (3399) do
										L_37_ = (6435840)
										while L_143_ <= (29) do
											L_37_ = -L_37_
											local L_175_;
											local L_176_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_25_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_17_]] = L_142_[L_29_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_176_ = L_142_[L_17_]
											L_133_[L_176_] = L_133_[L_176_](L_44_(L_133_, L_176_ + L_11_, L_142_[L_24_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_24_]][L_133_[L_142_[L_23_]]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_176_ = L_142_[L_15_]
											L_133_[L_176_] = L_133_[L_176_](L_133_[L_176_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_175_ = L_133_[L_142_[L_18_]];
											if not L_175_ then
												L_140_ = L_140_ + L_7_;
											else
												L_133_[L_142_[L_14_]] = L_175_;
												L_140_ = L_142_[L_27_];
											end;
											break;
										end
										while (L_37_) / (1676) == 3840 do
											L_37_ = (127755)
											while (30) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_14_]] = L_142_[L_29_];
												break
											end
											while 255 == (L_37_) / (501) do
												L_133_[L_142_[L_16_]] = L_133_[L_142_[L_27_]][L_142_[L_18_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / (2538) == 3868 do
								L_37_ = (2107695)
								while (36) >= L_143_ do
									L_37_ = -L_37_
									L_37_ = (274071)
									while (33) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (1456580)
										while L_143_ > (32) do
											L_37_ = -L_37_
											L_125_arg1[L_142_[L_27_]] = L_133_[L_142_[L_12_]];
											break
										end
										while (L_37_) / (2174) == 670 do
											do
												return
											end;
											break
										end;
										break;
									end
									while (L_37_) / (421) == 651 do
										L_37_ = (85870)
										while L_143_ <= (34) do
											L_37_ = -L_37_
											local L_177_ = L_142_[L_12_]
											L_133_[L_177_](L_133_[L_177_ + L_7_])
											break;
										end
										while 1385 == (L_37_) / (62) do
											L_37_ = (7866067)
											while (35) < L_143_ do
												L_37_ = -L_37_
												local L_178_ = L_142_[L_25_];
												local L_179_ = L_133_[L_178_]
												for L_180_forvar0 = L_178_ + 1, L_142_[L_18_] do
													L_179_ = L_179_ .. L_133_[L_180_forvar0];
												end;
												L_133_[L_142_[L_15_]] = L_179_;
												break
											end
											while 2893 == (L_37_) / (2719) do
												if L_133_[L_142_[L_12_]] then
													L_140_ = L_140_ + L_11_;
												else
													L_140_ = L_142_[L_25_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / (1857) == 1135 do
									L_37_ = (6322822)
									while L_143_ <= (39) do
										L_37_ = -L_37_
										L_37_ = (2463700)
										while L_143_ <= (37) do
											L_37_ = -L_37_
											L_140_ = L_142_[L_25_];
											break;
										end
										while 1388 == (L_37_) / (1775) do
											L_37_ = (7746024)
											while (38) < L_143_ do
												L_37_ = -L_37_
												local L_181_ = L_142_[L_17_];
												local L_182_ = L_133_[L_181_]
												local L_183_ = L_133_[L_181_ + 2];
												if (L_183_ > 0) then
													if (L_182_ > L_133_[L_181_ + 1]) then
														L_140_ = L_142_[L_26_];
													else
														L_133_[L_181_ + 3] = L_182_;
													end
												elseif (L_182_ < L_133_[L_181_ + 1]) then
													L_140_ = L_142_[L_29_];
												else
													L_133_[L_181_ + 3] = L_182_;
												end
												break
											end
											while 1924 == (L_37_) / (4026) do
												L_133_[L_142_[L_14_]] = (L_142_[L_24_] ~= 0);
												L_140_ = L_140_ + L_7_;
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / (3937) == 1606 do
										L_37_ = (1841875)
										while L_143_ <= (40) do
											L_37_ = -L_37_
											local L_184_ = L_135_[L_142_[L_25_]];
											local L_185_;
											local L_186_ = {};
											L_185_ = L_32_({}, {
												__index = function(L_187_arg0, L_188_arg1)
													local L_189_ = L_186_[L_188_arg1];
													return L_189_[1][L_189_[2]];
												end,
												__newindex = function(L_190_arg0, L_191_arg1, L_192_arg2)
													local L_193_ = L_186_[L_191_arg1]
													L_193_[1][L_193_[2]] = L_192_arg2;
												end;
											});
											for L_194_forvar0 = 1, L_142_[L_19_] do
												L_140_ = L_140_ + L_7_;
												local L_195_ = L_130_[L_140_];
												if L_195_[(1)] == 10 then
													L_186_[L_194_forvar0 - 1] = {
														L_133_,
														L_195_[L_29_]
													};
												else
													L_186_[L_194_forvar0 - 1] = {
														L_125_arg1,
														L_195_[L_27_]
													};
												end;
												L_132_[#L_132_ + 1] = L_186_;
											end;
											L_133_[L_142_[L_12_]] = L_54_func(L_184_, L_185_, L_126_arg2);
											break;
										end
										while 625 == (L_37_) / (2947) do
											L_37_ = (4809644)
											while (41) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_13_]] = (L_142_[L_26_] ~= 0);
												L_140_ = L_140_ + L_7_;
												break
											end
											while (L_37_) / (3241) == 1484 do
												local L_196_;
												L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_28_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_15_]] = L_126_arg2[L_142_[L_29_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_14_]] = L_142_[L_26_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_16_]] = L_142_[L_27_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = L_142_[L_29_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_196_ = L_142_[L_13_]
												L_133_[L_196_] = L_133_[L_196_](L_44_(L_133_, L_196_ + L_11_, L_142_[L_25_]))
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_133_[L_142_[L_29_]][L_133_[L_142_[L_20_]]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_14_]] = L_125_arg1[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_196_ = L_142_[L_14_]
												L_133_[L_196_] = L_133_[L_196_](L_133_[L_196_ + L_7_])
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_125_arg1[L_142_[L_27_]] = L_133_[L_142_[L_15_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												do
													return
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						break;
					end
					while 842 == (L_37_) / (857) do
						L_37_ = (12574985)
						while L_143_ <= (63) do
							L_37_ = -L_37_
							L_37_ = (2542000)
							while (52) >= L_143_ do
								L_37_ = -L_37_
								L_37_ = (5700846)
								while L_143_ <= (47) do
									L_37_ = -L_37_
									L_37_ = (2752038)
									while L_143_ <= (44) do
										L_37_ = -L_37_
										L_37_ = (3035109)
										while (43) < L_143_ do
											L_37_ = -L_37_
											local L_197_ = L_142_[L_26_];
											local L_198_ = L_133_[L_197_]
											for L_199_forvar0 = L_197_ + 1, L_142_[L_20_] do
												L_198_ = L_198_ .. L_133_[L_199_forvar0];
											end;
											L_133_[L_142_[L_16_]] = L_198_;
											break
										end
										while (L_37_) / (1877) == 1617 do
											if (L_133_[L_142_[L_15_]] ~= L_133_[L_142_[L_22_]]) then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_27_];
											end;
											break
										end;
										break;
									end
									while (L_37_) / (3253) == 846 do
										L_37_ = (5550874)
										while (45) >= L_143_ do
											L_37_ = -L_37_
											local L_200_ = L_142_[L_13_];
											local L_201_ = L_133_[L_142_[L_28_]];
											L_133_[L_200_ + 1] = L_201_;
											L_133_[L_200_] = L_201_[L_142_[L_21_]];
											break;
										end
										while (L_37_) / (2822) == 1967 do
											L_37_ = (10047477)
											while (46) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_16_]] = L_133_[L_142_[L_25_]] % L_142_[L_20_];
												break
											end
											while 2937 == (L_37_) / (3421) do
												L_133_[L_142_[L_16_]] = {};
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 2859 == (L_37_) / (1994) do
									L_37_ = (2300562)
									while L_143_ <= (49) do
										L_37_ = -L_37_
										L_37_ = (1113191)
										while (48) < L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_14_]] = L_54_func(L_135_[L_142_[L_29_]], nil, L_126_arg2);
											break
										end
										while (L_37_) / (1429) == 779 do
											local L_202_;
											local L_203_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_142_[L_29_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_26_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_203_ = L_142_[L_28_];
											L_202_ = L_133_[L_203_]
											for L_204_forvar0 = L_203_ + 1, L_142_[L_18_] do
												L_202_ = L_202_ .. L_133_[L_204_forvar0];
											end;
											L_133_[L_142_[L_14_]] = L_202_;
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											if not L_133_[L_142_[L_12_]] then
												L_140_ = L_140_ + L_7_;
											else
												L_140_ = L_142_[L_24_];
											end;
											break
										end;
										break;
									end
									while 3873 == (L_37_) / (594) do
										L_37_ = (135681)
										while L_143_ <= (50) do
											L_37_ = -L_37_
											local L_205_;
											local L_206_, L_207_;
											local L_208_;
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_26_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_28_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_26_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_208_ = L_142_[L_14_]
											L_206_, L_207_ = L_137_(L_133_[L_208_](L_44_(L_133_, L_208_ + 1, L_142_[L_25_])))
											L_131_ = L_207_ + L_208_ - 1
											L_205_ = 0;
											for L_209_forvar0 = L_208_, L_131_ do
												L_205_ = L_205_ + L_11_;
												L_133_[L_209_forvar0] = L_206_[L_205_];
											end;
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_208_ = L_142_[L_16_]
											L_133_[L_208_](L_44_(L_133_, L_208_ + L_7_, L_131_))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											do
												return
											end;
											break;
										end
										while 147 == (L_37_) / (923) do
											L_37_ = (7774620)
											while L_143_ > (51) do
												L_37_ = -L_37_
												if not L_133_[L_142_[L_13_]] then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_26_];
												end;
												break
											end
											while 2595 == (L_37_) / (2996) do
												local L_210_;
												local L_211_;
												L_133_[L_142_[L_14_]] = (L_142_[L_26_] ~= 0);
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = L_133_[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = L_126_arg2[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_211_ = L_142_[L_16_]
												L_133_[L_211_] = L_133_[L_211_](L_133_[L_211_ + L_7_])
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_210_ = L_133_[L_142_[L_20_]];
												if not L_210_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_15_]] = L_210_;
													L_140_ = L_142_[L_28_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / (775) == 3280 do
								L_37_ = (380982)
								while L_143_ <= (57) do
									L_37_ = -L_37_
									L_37_ = (7692721)
									while (54) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (6415734)
										while L_143_ > (53) do
											L_37_ = -L_37_
											local L_212_ = L_142_[L_15_]
											L_133_[L_212_] = L_133_[L_212_](L_133_[L_212_ + L_7_])
											break
										end
										while (L_37_) / (3237) == 1982 do
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_26_]][L_133_[L_142_[L_20_]]];
											break
										end;
										break;
									end
									while 2533 == (L_37_) / (3037) do
										L_37_ = (3012856)
										while (55) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_17_]] = L_126_arg2[L_142_[L_27_]];
											break;
										end
										while (L_37_) / (3212) == 938 do
											L_37_ = (5256720)
											while (56) < L_143_ do
												L_37_ = -L_37_
												do
													return
												end;
												break
											end
											while (L_37_) / (2205) == 2384 do
												local L_213_ = L_142_[L_12_]
												L_133_[L_213_] = L_133_[L_213_](L_133_[L_213_ + L_7_])
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while (L_37_) / (282) == 1351 do
									L_37_ = (6615420)
									while L_143_ <= (60) do
										L_37_ = -L_37_
										L_37_ = (2984384)
										while (58) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_13_]] = L_133_[L_142_[L_27_]];
											break;
										end
										while 3536 == (L_37_) / (844) do
											L_37_ = (8391657)
											while (59) < L_143_ do
												L_37_ = -L_37_
												if (L_133_[L_142_[L_14_]] ~= L_133_[L_142_[L_23_]]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_24_];
												end;
												break
											end
											while (L_37_) / (2787) == 3011 do
												L_133_[L_142_[L_14_]] = L_125_arg1[L_142_[L_24_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = #L_133_[L_142_[L_26_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_125_arg1[L_142_[L_24_]] = L_133_[L_142_[L_14_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_125_arg1[L_142_[L_25_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = #L_133_[L_142_[L_27_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_125_arg1[L_142_[L_27_]] = L_133_[L_142_[L_15_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												do
													return
												end;
												break
											end;
											break;
										end
										break;
									end
									while 1995 == (L_37_) / (3316) do
										L_37_ = (7826349)
										while (61) >= L_143_ do
											L_37_ = -L_37_
											local L_214_;
											local L_215_;
											local L_216_;
											L_133_[L_142_[L_17_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_15_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = #L_133_[L_142_[L_27_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_17_]] = L_142_[L_29_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_216_ = L_142_[L_13_];
											L_215_ = L_133_[L_216_]
											L_214_ = L_133_[L_216_ + 2];
											if (L_214_ > 0) then
												if (L_215_ > L_133_[L_216_ + 1]) then
													L_140_ = L_142_[L_28_];
												else
													L_133_[L_216_ + 3] = L_215_;
												end
											elseif (L_215_ < L_133_[L_216_ + 1]) then
												L_140_ = L_142_[L_28_];
											else
												L_133_[L_216_ + 3] = L_215_;
											end
											break;
										end
										while 3037 == (L_37_) / (2577) do
											L_37_ = (11435831)
											while (62) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_12_]] = {};
												break
											end
											while 3509 == (L_37_) / (3259) do
												local L_217_ = L_142_[L_15_];
												local L_218_ = L_133_[L_142_[L_24_]];
												L_133_[L_217_ + 1] = L_218_;
												L_133_[L_217_] = L_218_[L_142_[L_22_]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						while 3095 == (L_37_) / (4063) do
							L_37_ = (4100616)
							while L_143_ <= (74) do
								L_37_ = -L_37_
								L_37_ = (9101190)
								while L_143_ <= (68) do
									L_37_ = -L_37_
									L_37_ = (6168264)
									while L_143_ <= (65) do
										L_37_ = -L_37_
										L_37_ = (10627545)
										while (64) < L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_17_]] = L_54_func(L_135_[L_142_[L_25_]], nil, L_126_arg2);
											break
										end
										while 3671 == (L_37_) / (2895) do
											local L_219_;
											local L_220_;
											L_133_[L_142_[L_16_]] = L_126_arg2[L_142_[L_24_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_28_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_142_[L_25_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_14_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_220_ = L_142_[L_17_]
											L_133_[L_220_] = L_133_[L_220_](L_44_(L_133_, L_220_ + L_11_, L_142_[L_28_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_27_]][L_133_[L_142_[L_19_]]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_220_ = L_142_[L_15_]
											L_133_[L_220_] = L_133_[L_220_](L_133_[L_220_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_219_ = L_133_[L_142_[L_18_]];
											if not L_219_ then
												L_140_ = L_140_ + L_7_;
											else
												L_133_[L_142_[L_13_]] = L_219_;
												L_140_ = L_142_[L_27_];
											end;
											break
										end;
										break;
									end
									while (L_37_) / (3336) == 1849 do
										L_37_ = (8411844)
										while (66) >= L_143_ do
											L_37_ = -L_37_
											local L_221_;
											L_133_[L_142_[L_17_]] = L_126_arg2[L_142_[L_29_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_26_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_16_]] = L_142_[L_24_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_13_]] = L_142_[L_26_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_14_]] = L_142_[L_27_];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_221_ = L_142_[L_12_]
											L_133_[L_221_] = L_133_[L_221_](L_44_(L_133_, L_221_ + L_11_, L_142_[L_27_]))
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_12_]] = L_133_[L_142_[L_26_]][L_133_[L_142_[L_18_]]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_221_ = L_142_[L_13_]
											L_133_[L_221_] = L_133_[L_221_](L_133_[L_221_ + L_7_])
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_133_[L_142_[L_17_]] = L_133_[L_142_[L_24_]];
											L_140_ = L_140_ + L_11_;
											L_142_ = L_130_[L_140_];
											L_140_ = L_142_[L_29_];
											break;
										end
										while 3346 == (L_37_) / (2514) do
											L_37_ = (6262596)
											while (67) < L_143_ do
												L_37_ = -L_37_
												local L_222_ = L_142_[L_13_]
												L_133_[L_222_] = L_133_[L_222_](L_44_(L_133_, L_222_ + L_11_, L_142_[L_28_]))
												break
											end
											while 3411 == (L_37_) / (1836) do
												local L_223_ = L_133_[L_142_[L_22_]];
												if not L_223_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_14_]] = L_223_;
													L_140_ = L_142_[L_29_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 3990 == (L_37_) / (2281) do
									L_37_ = (6928209)
									while L_143_ <= (71) do
										L_37_ = -L_37_
										L_37_ = (3265080)
										while (69) >= L_143_ do
											L_37_ = -L_37_
											local L_224_ = L_142_[L_12_]
											local L_225_, L_226_ = L_137_(L_133_[L_224_](L_44_(L_133_, L_224_ + 1, L_142_[L_25_])))
											L_131_ = L_226_ + L_224_ - 1
											local L_227_ = 0;
											for L_228_forvar0 = L_224_, L_131_ do
												L_227_ = L_227_ + L_11_;
												L_133_[L_228_forvar0] = L_225_[L_227_];
											end;
											break;
										end
										while 1820 == (L_37_) / (1794) do
											L_37_ = (1103862)
											while (70) < L_143_ do
												L_37_ = -L_37_
												L_133_[L_142_[L_15_]] = (L_142_[L_29_] ~= 0);
												break
											end
											while 437 == (L_37_) / (2526) do
												L_126_arg2[L_142_[L_28_]] = L_133_[L_142_[L_13_]];
												break
											end;
											break;
										end
										break;
									end
									while (L_37_) / (2927) == 2367 do
										L_37_ = (1533508)
										while L_143_ <= (72) do
											L_37_ = -L_37_
											do
												return L_133_[L_142_[L_14_]]
											end
											break;
										end
										while (L_37_) / (2573) == 596 do
											L_37_ = (1605072)
											while L_143_ > (73) do
												L_37_ = -L_37_
												local L_229_;
												local L_230_;
												L_133_[L_142_[L_17_]] = L_126_arg2[L_142_[L_26_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_15_]] = L_126_arg2[L_142_[L_26_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = L_142_[L_25_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_14_]] = L_142_[L_28_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_142_[L_24_];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_230_ = L_142_[L_16_]
												L_133_[L_230_] = L_133_[L_230_](L_44_(L_133_, L_230_ + L_11_, L_142_[L_28_]))
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = L_133_[L_142_[L_29_]][L_133_[L_142_[L_20_]]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_230_ = L_142_[L_17_]
												L_133_[L_230_] = L_133_[L_230_](L_133_[L_230_ + L_7_])
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_229_ = L_133_[L_142_[L_22_]];
												if not L_229_ then
													L_140_ = L_140_ + L_7_;
												else
													L_133_[L_142_[L_13_]] = L_229_;
													L_140_ = L_142_[L_25_];
												end;
												break
											end
											while 1904 == (L_37_) / (843) do
												L_133_[L_142_[L_14_]] = L_133_[L_142_[L_24_]][L_133_[L_142_[L_19_]]];
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							while (L_37_) / (1014) == 4044 do
								L_37_ = (3740160)
								while L_143_ <= (79) do
									L_37_ = -L_37_
									L_37_ = (16112027)
									while (76) >= L_143_ do
										L_37_ = -L_37_
										L_37_ = (5650248)
										while L_143_ > (75) do
											L_37_ = -L_37_
											L_133_[L_142_[L_13_]] = L_133_[L_142_[L_24_]] - L_133_[L_142_[L_20_]];
											break
										end
										while 1866 == (L_37_) / (3028) do
											local L_231_ = {
												L_133_,
												L_142_
											};
											L_231_[L_7_][L_231_[L_6_][L_12_]] = L_231_[L_11_][L_231_[L_6_][L_21_]] + L_231_[L_7_][L_231_[L_6_][L_25_]];
											break
										end;
										break;
									end
									while 4027 == (L_37_) / (4001) do
										L_37_ = (10030194)
										while (77) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_16_]] = L_133_[L_142_[L_25_]][L_142_[L_22_]];
											break;
										end
										while 3114 == (L_37_) / (3221) do
											L_37_ = (489060)
											while L_143_ > (78) do
												L_37_ = -L_37_
												local L_232_ = L_142_[L_14_]
												L_133_[L_232_](L_44_(L_133_, L_232_ + L_7_, L_131_))
												break
											end
											while 429 == (L_37_) / (1140) do
												local L_233_ = L_142_[L_12_];
												local L_234_ = L_133_[L_233_]
												local L_235_ = L_133_[L_233_ + 2];
												if (L_235_ > 0) then
													if (L_234_ > L_133_[L_233_ + 1]) then
														L_140_ = L_142_[L_26_];
													else
														L_133_[L_233_ + 3] = L_234_;
													end
												elseif (L_234_ < L_133_[L_233_ + 1]) then
													L_140_ = L_142_[L_24_];
												else
													L_133_[L_233_ + 3] = L_234_;
												end
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								while 1948 == (L_37_) / (1920) do
									L_37_ = (6361478)
									while L_143_ <= (82) do
										L_37_ = -L_37_
										L_37_ = (74340)
										while (80) >= L_143_ do
											L_37_ = -L_37_
											L_133_[L_142_[L_14_]] = L_142_[L_26_];
											break;
										end
										while (L_37_) / (1652) == 45 do
											L_37_ = (5556996)
											while L_143_ > (81) do
												L_37_ = -L_37_
												local L_236_ = L_142_[L_16_]
												local L_237_, L_238_ = L_137_(L_133_[L_236_](L_44_(L_133_, L_236_ + 1, L_142_[L_27_])))
												L_131_ = L_238_ + L_236_ - 1
												local L_239_ = 0;
												for L_240_forvar0 = L_236_, L_131_ do
													L_239_ = L_239_ + L_11_;
													L_133_[L_240_forvar0] = L_237_[L_239_];
												end;
												break
											end
											while 2841 == (L_37_) / (1956) do
												L_133_[L_142_[L_17_]] = L_125_arg1[L_142_[L_29_]];
												break
											end;
											break;
										end
										break;
									end
									while 1886 == (L_37_) / (3373) do
										L_37_ = (1161984)
										while L_143_ <= (83) do
											L_37_ = -L_37_
											L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_29_]];
											break;
										end
										while (L_37_) / (2136) == 544 do
											L_37_ = (3117204)
											while (84) < L_143_ do
												L_37_ = -L_37_
												L_126_arg2[L_142_[L_26_]] = L_133_[L_142_[L_13_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_17_]] = {};
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_12_]] = {};
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_126_arg2[L_142_[L_29_]] = L_133_[L_142_[L_14_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												L_133_[L_142_[L_13_]] = L_126_arg2[L_142_[L_27_]];
												L_140_ = L_140_ + L_11_;
												L_142_ = L_130_[L_140_];
												if (L_133_[L_142_[L_14_]] == L_142_[L_20_]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_27_];
												end;
												break
											end
											while (L_37_) / (2138) == 1458 do
												if (L_133_[L_142_[L_15_]] == L_142_[L_19_]) then
													L_140_ = L_140_ + L_7_;
												else
													L_140_ = L_142_[L_26_];
												end;
												break
											end;
											break;
										end
										break;
									end
									break;
								end
								break;
							end
							break;
						end
						break;
					end
					L_140_ = L_140_ + L_11_;
				end;
			end);
		end;
		return L_54_func(L_53_func(), {}, L_4_())()
	end)
	_msec({
		[(142)] = 'st' .. (function(L_241_arg0)
			return (L_241_arg0 and '؃ؠ؃ؠدجنټآضئض') or 'ri' or 'x\58'
		end)(false) .. 'ng',
		["ڝسققآنڝؠؠضقك"] = 'ld' .. (function(L_242_arg0)
			return (L_242_arg0 and 'ڪجڝزڪئججسڪڪكضق') or 'ex' or 'wo'
		end)(false) .. 'p',
		["ڪڝآ؃قدكقق"] = (function(L_243_arg0)
			return (L_243_arg0 and 'زڝكضټزججآق؃قزنڝ') and 'by' or 'dx'
		end)(true) .. 'te',
		["ڝح؃سآټجټؠ"] = 'c' .. (function(L_244_arg0)
			return (L_244_arg0 and 'د؃سنټقڝقسحټ') and 'Z\19\157' or 'ha'
		end)(false) .. 'r',
		[(552)] = 'ta' .. (function(L_245_arg0)
			return (L_245_arg0 and 'ؠدؠزنټآقضدقجسزضڝ') and '\64q' or 'bl'
		end)(false) .. 'e',
		["جكضكجئڝسڝ"] = (function(L_246_arg0)
			return (L_246_arg0 and 'قدكضآقجججدزټ') or 'su' or 'Nk'
		end)(false) .. 'b',
		["ؠآدزڝدآسجكڪحضټكضئآز"] = 'co' .. (function(L_247_arg0)
			return (L_247_arg0 and 'حئڝټجزڝئقحسټئ') and 'nc' or 'niga'
		end)(true) .. 'at',
		[(647)] = (function(L_248_arg0, L_249_arg1)
			return (L_248_arg0 and 'ككآدؠڪآټؠس') and '\48\159\158\188\10' or 'ma'
		end)(false) .. 'th',
		[(1351)] = (function(L_250_arg0, L_251_arg1)
			return (false or L_250_arg0 .. (false or L_251_arg1)) or '\199\203\95'
		end),
		["؃ددكدڝسسضز؃حڪئ"] = 'in' .. (function(L_252_arg0, L_253_arg1)
			return (L_252_arg0 and 'ڪئكټدججؠ؃ضڝنح؃ڝزجكڪ') and 'Zs\138s\15' or 'se'
		end)(false) .. 'rt',
		["حقټجحججج؃آسزسجڝدنز"] = 'un' .. (function(L_254_arg0, L_255_arg1)
			return (L_254_arg0 and 'جنكنزآكقسضسؠنؠجڝضحټ') or 'pa' or '\20\38\154'
		end)(false) .. 'ck',
		["ڪټززكحڝزقؠسڝحزڝټحضؠ"] = 'se' .. (function(L_256_arg0)
			return (L_256_arg0 and 'ئحضؠ؃كضقؠ') and 'npch' or 'le'
		end)(false) .. 'ct',
		["دحقجټدضجككجسئآكج؃آؠ"] = 'ton' .. (function(L_257_arg0, L_258_arg1)
			return (L_257_arg0 and 'نڝدنآآقڪآح') and 'umb' or 'daxz'
		end)(true) .. 'er'
	}, {
		["ټټ؃سحڝ؃دحن"] = ((getfenv) or (function()
			return (_ENV)
		end))
	}, ((getfenv) or (function()
		return (_ENV)
	end))())
end)()